analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32657/Include/max32657.svd
   </registers>
  </peripheral>

  <peripheral>
   <name>BOOST</name>
   <description>Boost Controller</description>
   <baseAddress>0x50004C00</baseAddress>
   <addressBlock>
    <offset>0x00</offset>
    <size>0x400</size>
    <usage>registers</usage>
   </addressBlock>
   <interrupt>
    <name>BOOST</name>
    <value>46</value>
   </interrupt>
   <registers>
    <register>
     <name>DISABLE</name>
     <description>Boost Disable Register.</description>
     <addressOffset>0x000</addressOffset>
     <size>32</size>
     <fields>
      <field>
       <name>DIS</name>
       <description>This bit allows softwaree to disable the boost regulator for the VDD18 supply.</description>
       <bitRange>[0:0]</bitRange>
       <access>read-write</access>
      </field>
     </fields>
    </register>
    <register>
     <name>VREGCTRL</name>
     <description>Boost Voltage Regulator Control Register.</description>
     <addressOffset>0x004</addressOffset>
     <fields>
      <field>
       <name>SET</name>
       <description>Sets the target voltage for the boost regulator output.</description>
       <bitRange>[4:0]</bitRange>
       <access>read-write</access>
      </field>
     </fields>
    </register>
    <register>
     <name>IPEAK</name>
     <description>Low Side FET Peak Current Register.</description>
     <addressOffset>0x008</addressOffset>
     <access>read-only</access>
     <fields>
      <field>
       <name>SET</name>
       <description>Sets the peak current threshold for the regulator.</description>
       <bitRange>[2:0]</bitRange>
       <access>read-only</access>
      </field>
     </fields>
    </register>
    <register>
     <name>MAXTON</name>
     <description>Maximum Low Side FET Time-On Register.</description>
     <addressOffset>0x00C</addressOffset>
     <access>read-only</access>
     <fields>
      <field>
       <name>THD</name>
       <description>Sets a threshold for when time-on out toggles.</description>
       <bitRange>[3:0]</bitRange>
       <access>read-only</access>
      </field>
     </fields>
    </register>
    <register>
     <name>ILOAD</name>
     <description>Boost Cycle Count Register.</description>
     <addressOffset>0x010</addressOffset>
     <access>read-only</access>
     <fields>
      <field>
       <name>CNT</name>
       <description>Indicates the last load cycle count value.</description>
       <bitRange>[7:0]</bitRange>
       <access>read-only</access>
      </field>
     </fields>
    </register>
    <register>
     <name>ALERT</name>
     <description>Boost Cycle Count Alert Register.</description>
     <addressOffset>0x014</addressOffset>
     <fields>
      <field>
       <name>THD</name>
       <description>Determines the threshold for when the boost alert interruptis fired.</description>
       <bitRange>[7:0]</bitRange>
       <access>read-write</access>
      </field>
     </fields>
    </register>
    <register>
     <name>RDY</name>
     <description>Boost Output Ready Register.</description>
     <addressOffset>0x018</addressOffset>
     <access>read-only</access>
     <fields>
      <field>
       <name>OUT</name>
       <description>Indicates ready out status for boost regulator.</description>
       <bitRange>[0:0]</bitRange>
       <access>read-only</access>
      </field>
     </fields>
    </register>
    <register>
     <name>ZXCAL</name>
     <description>Zero Cross Calibration Register.</description>
     <addressOffset>0x01C</addressOffset>
     <access>read-only</access>
     <fields>
      <field>
       <name>VAL</name>
       <description>Read back of auto-calibration values.</description>
       <bitRange>[4:0]</bitRange>
       <access>read-only</access>
      </field>
     </fields>
    </register>
    <register>
     <name>INTEN</name>
     <description>Boost Alert Interrupt Enable Register.</description>
     <addressOffset>0x020</addressOffset>
     <access>read-write</access>
     <fields>
      <field>
       <name>ALERT</name>
       <description>Boost alert enable/</description>
       <bitRange>[0:0]</bitRange>
       <access>read-write</access>
      </field>
     </fields>
    </register>
    <register>
     <name>INTFL</name>
     <description>Boost Alert Interrupt Status Register.</description>
     <addressOffset>0x024</addressOffset>
     <access>read-write</access>
     <fields>
      <field>
       <name>ALERT</name>
       <description>Boost alert has occurred.</description>
       <bitRange>[0:0]</bitRange>
       <access>read-write</access>
      </field>
     </fields>
    </register>
   </registers>
  </peripheral>

  <peripheral>
   <name>CRC</name>
   <description>CRC Registers.</description>
   <baseAddress>0x5000F000</baseAddress>
   <addressBlock>
    <offset>0x00</offset>
    <size>0x1000</size>
    <usage>registers</usage>
   </addressBlock>
   <registers>
    <register>
     <name>CTRL</name>
     <description>CRC Control</description>
     <addressOffset>0x0000</addressOffset>
     <size>32</size>
     <fields>
      <field>
       <name>EN</name>
       <description>CRC Enable</description>
       <bitRange>[0:0]</bitRange>
       <access>read-write</access>
      </field>
      <field>
       <name>DMA_EN</name>
       <description>DMA Request Enable</description>
       <bitRange>[1:1]</bitRange>
       <access>read-write</access>
      </field>
      <field>
       <name>MSB</name>
       <description>MSB Select</description>
       <bitRange>[2:2]</bitRange>
       <access>read-write</access>
      </field>
      <field>
       <name>BYTE_SWAP_IN</name>
       <description>Byte Swap CRC Data Input</description>
       <bitRange>[3:3]</bitRange>
       <access>read-write</access>
      </field>
      <field>
       <name>BYTE_SWAP_OUT</name>
       <description>Byte Swap CRC Value Output</description>
       <bitRange>[4:4]</bitRange>
       <access>read-write</access>
      </field>
      <field>
       <name>BUSY</name>
       <description>CRC Busy</description>
       <bitRange>[16:16]</bitRange>
       <access>read-write</access>
      </field>
     </fields>
    </register>
    <register>
     <name>DATAIN32</name>
     <description>CRC Data Input</description>
     <addressOffset>0x0004</addressOffset>
     <fields>
      <field>
       <name>DATA</name>
       <description>CRC Data</description>
       <bitRange>[31:0]</bitRange>
       <access>read-write</access>
      </field>
     </fields>
    </register>
    <register>
     <name>DATAIN16</name>
     <description>CRC Data Input</description>
     <addressOffset>0x0004</addressOffset>
     <size>16</size>
     <access>read-write</access>
     <fields>
      <field>
       <name>DATA</name>
       <description>CRC Data</description>
       <bitOffset>0</bitOffset>
       <bitWidth>16</bitWidth>
       <access>read-write</access>
      </field>
     </fields>
    </register>
    <register>
     <name>DATAIN8</name>
     <description>CRC Data Input</description>
     <addressOffset>0x0004</addressOffset>
     <size>8</size>
     <access>read-write</access>
     <fields>
      <field>
       <name>DATA</name>
       <description>CRC Data</description>
       <bitOffset>0</bitOffset>
       <bitWidth>8</bitWidth>
       <access>read-write</access>
      </field>
     </fields>
    </register>
    <register>
     <name>POLY</name>
     <description>CRC Polynomial</description>
     <addressOffset>0x0008</addressOffset>
     <fields>
      <field>
       <name>POLY</name>
       <description>CRC Polynomial</description>
       <bitRange>[31:0]</bitRange>
       <access>read-write</access>
      </field>
     </fields>
    </register>
    <register>
     <name>VAL</name>
     <description>Current CRC Value</description>
     <addressOffset>0x000C</addressOffset>
     <fields>
      <field>
       <name>VALUE</name>
       <description>Current CRC Value</description>
       <bitRange>[31:0]</bitRange>
       <access>read-write</access>
      </field>
     </fields>
    </register>
