analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32657/Include/max32657.svd
   </registers>
  </peripheral>

  <peripheral derivedFrom="DMA">
   <name>DMA1</name>
   <description>DMA Controller Fully programmable, chaining capable DMA channels. 1</description>
   <baseAddress>0x50035000</baseAddress>
   <interrupt>
    <name>DMA1_CH0</name>
    <description>DMA1_CH0</description>
    <value>36</value>
   </interrupt>
   <interrupt>
    <name>DMA1_CH1</name>
    <description>DMA1_CH1</description>
    <value>37</value>
   </interrupt>
   <interrupt>
    <name>DMA1_CH2</name>
    <description>DMA1_CH2</description>
    <value>38</value>
   </interrupt>
   <interrupt>
    <name>DMA1_CH3</name>
    <description>DMA1_CH3</description>
    <value>39</value>
   </interrupt>
  </peripheral>

  <peripheral>
   <name>FCR</name>
   <description>Function Control Register.</description>
   <baseAddress>0x50000800</baseAddress>
   <addressBlock>
    <offset>0x00</offset>
    <size>0x400</size>
    <usage>registers</usage>
   </addressBlock>
   <registers>
    <register>
     <name>CTRL</name>
     <description>Function Control 0 Register.</description>
     <addressOffset>0x00</addressOffset>
     <access>read-write</access>
     <fields>
      <field>
       <name>I3CDGEN0</name>
       <description>I3C SDA Glitch Filter Enable.</description>
       <bitOffset>20</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>dis</name>
         <description>Filter disabled.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>en</name>
         <description>Filter enabled.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>I3CDGEN1</name>
       <description>I3C SCL Glitch Filter Enable.</description>
       <bitOffset>21</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>dis</name>
         <description>Filter disabled.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>en</name>
         <description>Filter enabled.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
     </fields>
    </register>
    <register>
     <name>AUTOCAL0</name>
     <description>Automatic Calibration 0 Register.</description>
     <addressOffset>0x04</addressOffset>
     <access>read-write</access>
     <fields>
      <field>
       <name>EN</name>
       <description>Auto-calibration Enable.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>dis</name>
         <description>Disabled.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>en</name>
         <description>Enabled.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>RUN</name>
       <description>Autocalibration Run.</description>
       <bitOffset>1</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>not</name>
         <description>Not Running.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>run</name>
         <description>Running.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>LOAD_TRIM</name>
       <description>Load Trim.</description>
       <bitOffset>2</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>GAIN_INV</name>
       <description>Invert Gain.</description>
       <bitOffset>3</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>not</name>
         <description>Not Running.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>run</name>
         <description>Running.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>ATOMIC</name>
       <description>Atomic mode.</description>
       <bitOffset>4</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>not</name>
         <description>Not Running.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>run</name>
         <description>Running.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>MU</name>
       <description>MU value.</description>
       <bitOffset>8</bitOffset>
       <bitWidth>12</bitWidth>
      </field>
      <field>
       <name>TRIM_OUT</name>
       <description>IPO Auto Calibration Trim</description>
       <bitOffset>23</bitOffset>
       <bitWidth>9</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>AUTOCAL1</name>
     <description>Automatic Calibration 1 Register.</description>
     <addressOffset>0x08</addressOffset>
     <access>read-write</access>
     <fields>
      <field>
       <name>INIT_TRIM</name>
       <description>IPO Trim Automatic Calibration Initial Trim.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>9</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>AUTOCAL2</name>
     <description>Automatic Calibration 2 Register.</description>
     <addressOffset>0x0C</addressOffset>
     <access>read-write</access>
     <fields>
      <field>
       <name>RUNTIME</name>
       <description>IPO Trim Autocal Run Time</description>
       <bitOffset>0</bitOffset>
       <bitWidth>8</bitWidth>
      </field>
      <field>
       <name>DIV</name>
       <description>IPO Trim Automatic Calibration Divide Factor.</description>
       <bitOffset>8</bitOffset>
       <bitWidth>13</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>ERFOKS</name>
     <description>ERFO Kick Start Register.</description>
     <addressOffset>0x18</addressOffset>
     <access>read-write</access>
     <fields>
      <field>
       <name>CNT</name>
       <description>Kick Start ERFO Counter.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>7</bitWidth>
      </field>
      <field>
       <name>EN</name>
       <description>Kick Start ERFO Enable.</description>
       <bitOffset>7</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>DRVSTR</name>
       <description>Kick Start ERFO Drive Strength.</description>
       <bitOffset>8</bitOffset>
       <bitWidth>3</bitWidth>
      </field>
      <field>
       <name>X2_PLEN</name>
       <description>ERFO Kick Start Enable Double Pulse Length.</description>
       <bitOffset>11</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>CLKSEL</name>
       <description>Kick Start Clock Select for ERFO</description>
       <bitOffset>12</bitOffset>
       <bitWidth>2</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>NO_CLK</name>
         <description>No kick start clock.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>IPO</name>
         <description>IPO.</description>
         <value>3</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
     </fields>
    </register>
    <register>
     <name>INTFL</name>
     <description>Interrupt Flag Register.</description>
     <addressOffset>0x1C</addressOffset>
     <access>read-write</access>
     <fields>
      <field>
       <name>ERFO_RDY</name>
       <description>ERFO Ready.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>FRQCNT</name>
       <description>Frequency Counter Interrupt Flag.</description>
       <bitOffset>1</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>INTEN</name>
     <description>Interrupt Enable Register.</description>
     <addressOffset>0x20</addressOffset>
     <access>read-write</access>
     <fields>
      <field>
       <name>ERFO_RDY</name>
       <description>ERFO Ready Interrupt Enable.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>FRQCNT</name>
       <description>Frequency Counter Interrupt Enable.</description>
       <bitOffset>1</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>ERFOCTRL</name>
     <description>ERFO Control Register.</description>
     <addressOffset>0x24</addressOffset>
     <access>read-write</access>
     <fields>
      <field>
       <name>CAP_X1</name>
       <description>Load capacitor tuning bit for X1.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>7</bitWidth>
      </field>
      <field>
       <name>CAP_X2</name>
       <description>Load capacitor tuning bit for X2.</description>
       <bitOffset>7</bitOffset>
       <bitWidth>7</bitWidth>
      </field>
      <field>
       <name>CAP_BYPASS</name>
       <description>Bypass (disable) load capacitors.</description>
       <bitOffset>14</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>FRQCNTCTRL</name>
     <description>Frequency Counter Control Register.</description>
     <addressOffset>0x28</addressOffset>
     <access>read-write</access>
     <fields>
      <field>
       <name>START</name>
       <description>Start Compare.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>CMP_CLKSEL</name>
       <description>Compared Clock Select.</description>
       <bitOffset>1</bitOffset>
       <bitWidth>2</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>RTC</name>
         <description>RTC.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>EXT_GPIO</name>
         <description>External GPIO.</description>
         <value>2</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>INRO</name>
         <description>INRO.</description>
         <value>3</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
     </fields>
    </register>
    <register>
     <name>FRQCNTCMP</name>
     <description>Frequency Counter Compared Target Register.</description>
     <addressOffset>0x2C</addressOffset>
     <access>read-write</access>
     <fields>
      <field>
       <name>TARGET</name>
       <description>Compared Clock Target.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>14</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>REFCLK</name>
     <description>Reference Clock Result Register.</description>
     <addressOffset>0x30</addressOffset>
     <access>read-only</access>
     <fields>
      <field>
       <name>RESULT</name>
       <description>Reference Clock Result.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>20</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>CMPCLK</name>
     <description>Compared Clock Result Register.</description>
     <addressOffset>0x34</addressOffset>
     <access>read-only</access>
     <fields>
      <field>
       <name>RESULT</name>
       <description>Compared Clock Result.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>14</bitWidth>
      </field>
     </fields>
    </register>
