analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32657/Include/max32657.svd
    <register>
     <name>PCLKDIS1</name>
     <description>Peripheral Clock Disable.</description>
     <addressOffset>0x48</addressOffset>
     <fields>
      <field>
       <name>BTLE</name>
       <description>BTLE Clock Disable.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>en</name>
         <description>Enable.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>dis</name>
         <description>Disable.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field derivedFrom="BTLE">
       <name>TRNG</name>
       <description>TRNG Clock Disable.</description>
       <bitOffset>2</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="BTLE">
       <name>CRC</name>
       <description>CRC Disable.</description>
       <bitOffset>14</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="BTLE">
       <name>AES</name>
       <description>AES Clock Disable</description>
       <bitOffset>15</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="BTLE">
       <name>DMA1</name>
       <description>DMA1 Clock Disable</description>
       <bitOffset>21</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="BTLE">
       <name>WDT</name>
       <description>WDT Clock Disable</description>
       <bitOffset>27</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>EVENTEN</name>
     <description>Event Enable Register.</description>
     <addressOffset>0x4C</addressOffset>
     <fields>
      <field>
       <name>DMA0</name>
       <description>Enable DMA0 event. When this bit is set, a DMA0 event will cause an RXEV event to wake the CPU from WFE sleep mode.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>DMA1</name>
       <description>Enable DMA1 event. When this bit is set, a DMA1 event will cause an RXEV event to wake the CPU from WFE sleep mode.</description>
       <bitOffset>1</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>TX</name>
       <description>Enable TXEV pin event. When this bit is set, TXEV event from the CPU is output to GPIO[25].</description>
       <bitOffset>2</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>REVISION</name>
     <description>Revision Register.</description>
     <addressOffset>0x50</addressOffset>
     <access>read-only</access>
     <fields>
      <field>
       <name>REVISION</name>
       <description>Manufacturer Chip Revision. </description>
       <bitOffset>0</bitOffset>
       <bitWidth>16</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>SYSINTEN</name>
     <description>System Status Interrupt Enable Register.</description>
     <addressOffset>0x54</addressOffset>
     <fields>
      <field>
       <name>ICEUNLOCK</name>
       <description>ARM ICE Unlock Interrupt Enable.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>dis</name>
         <description>disabled.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>en</name>
         <description>enabled.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
     </fields>
    </register>
    <register>
     <name>ECCERR</name>
     <description>ECC Error Register</description>
     <addressOffset>0x64</addressOffset>
     <fields>
      <field>
       <name>FLASH</name>
       <description>ECC Flash Error Flag. Write 1 to clear.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>ECCCED</name>
     <description>ECC Correctable Error Detect Register.</description>
     <addressOffset>0x68</addressOffset>
     <fields>
      <field>
       <name>FLASH</name>
       <description>ECC Correctable Error Detect Flag for Flash. Write 1 to clear.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>ECCINTEN</name>
     <description>ECC Interrupt Enable Register</description>
     <addressOffset>0x6C</addressOffset>
     <fields>
      <field>
       <name>FLASH</name>
       <description>ECC Flash0 Interrupt Enable.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>ECCADDR</name>
     <description>ECC Error Address Register</description>
     <addressOffset>0x70</addressOffset>
     <fields>
      <field>
       <name>DADDR</name>
       <description>Address of Error in Data RAM.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>14</bitWidth>
      </field>
      <field>
       <name>DB</name>
       <description>Data Bank,</description>
       <bitOffset>14</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>DE</name>
       <description>Data Error Flag.</description>
       <bitOffset>15</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>TADDR</name>
       <description>Address of Error in Tag RAM.</description>
       <bitOffset>16</bitOffset>
       <bitWidth>14</bitWidth>
      </field>
      <field>
       <name>TB</name>
       <description>Tag Bank.</description>
       <bitOffset>30</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>TE</name>
       <description>Tag Error Flag.</description>
       <bitOffset>31</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>BTLELDOCTRL</name>
     <description>BTLE LDO Control Register</description>
     <addressOffset>0x74</addressOffset>
     <fields>
      <field>
       <name>BB_EN</name>
       <description>LDO BB enable.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>BB_PD_EN</name>
       <description>LDO BB Pull Down.</description>
       <bitOffset>1</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>BB_VSEL</name>
       <description>Voltage Selection for BB LDO.</description>
       <bitOffset>2</bitOffset>
       <bitWidth>2</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>0_9</name>
         <description>0.9V</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>1_0</name>
         <description>1.0V</description>
         <value>1</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>1_1</name>
         <description>1.1V</description>
         <value>2</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>1_2</name>
         <description>1.2V</description>
         <value>3</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>RF_EN</name>
       <description>LDO RF enable.</description>
       <bitOffset>4</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>RF_PD_EN</name>
       <description>LDO RF Pull DOwn.</description>
       <bitOffset>5</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>RF_VSEL</name>
       <description>LDO RF Voltage Setting.</description>
       <bitOffset>6</bitOffset>
       <bitWidth>2</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>0_9</name>
         <description>0.9V</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>1_0</name>
         <description>1.0V</description>
         <value>1</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>1_1</name>
         <description>1.1V</description>
         <value>2</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>1_2</name>
         <description>1.2V</description>
         <value>3</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>RF_BP_EN</name>
       <description>LDO RF Bypass Enable.</description>
       <bitOffset>8</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>RF_DISCH</name>
       <description>LDO RF Discharge.</description>
       <bitOffset>9</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>BB_BP_EN</name>
       <description>LDO BB Bypass Enable.</description>
       <bitOffset>10</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>BB_DISCH</name>
       <description>LDO BB Discharge.</description>
       <bitOffset>11</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>BB_EN_DLY</name>
       <description>LDO BB Enable Delay.</description>
       <bitOffset>12</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>RF_EN_DLY</name>
       <description>LDO RF Enable Delay.</description>
       <bitOffset>13</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>RF_BP_EN_DLY</name>
       <description>LDO RF Bypass Enable Delay.</description>
       <bitOffset>14</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>BB_BP_EN_DLY</name>
       <description>LDO BB Bypass Enable Delay.</description>
       <bitOffset>15</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>BTLELDODLY</name>
     <description>BTLE LDO Delay Register</description>
     <addressOffset>0x78</addressOffset>
     <fields>
      <field>
       <name>BP_CNT</name>
       <description>Bypass delay count.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>8</bitWidth>
      </field>
      <field>
       <name>BB_CNT</name>
       <description>BB delay count.</description>
       <bitOffset>8</bitOffset>
       <bitWidth>9</bitWidth>
      </field>
      <field>
       <name>RF_CNT</name>
       <description>RF delay count.</description>
       <bitOffset>20</bitOffset>
       <bitWidth>9</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>GPR</name>
     <description>General Purpose Register 0.</description>
     <addressOffset>0x80</addressOffset>
    </register>
