analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32657/Include/max32657.svd
    <register>
     <name>DS1</name>
     <description>GPIO Drive Strength 1 Register. Each bit in this register selects the drive strength for the associated GPIO pin in this port. Refer to the Datasheet for sink/source current of GPIO pins in each mode.</description>
     <addressOffset>0xB4</addressOffset>
     <fields>
      <field>
       <name>ALL</name>
       <description>Mask of all of the pins on the port.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>32</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>PSSEL</name>
     <description>GPIO Pull Select Mode.</description>
     <addressOffset>0xB8</addressOffset>
     <fields>
      <field>
       <name>ALL</name>
       <description>Mask of all of the pins on the port.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>32</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>VSSEL</name>
     <description>GPIO Voltage Select.</description>
     <addressOffset>0xC0</addressOffset>
     <fields>
      <field>
       <name>ALL</name>
       <description>Mask of all of the pins on the port.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>32</bitWidth>
      </field>
     </fields>
    </register>
   </registers>
  </peripheral>

  <peripheral>
   <name>I3C0</name>
   <description>Improved Inter-Integrated Circuit.</description>
   <groupName>I3C</groupName>
   <baseAddress>0x50018000</baseAddress>
   <size>32</size>
   <addressBlock>
    <offset>0x00</offset>
    <size>0x1000</size>
    <usage>registers</usage>
   </addressBlock>
   <interrupt>
    <name>I3C0</name>
    <description>I3C0 IRQ</description>
    <value>26</value>
   </interrupt>
   <registers>
    <register>
     <name>CONT_CTRL0</name>
     <description>Controller Control 0 (Configuration) Register.</description>
     <addressOffset>0x000</addressOffset>
     <fields>
      <field>
       <name>EN</name>
       <description>I3C Device Enable.</description>
       <bitRange>[1:0]</bitRange>
       <access>read-write</access>
       <enumeratedValues>
        <enumeratedValue>
         <name>OFF</name>
         <description>Off.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>ON</name>
         <description>On.</description>
         <value>1</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>CAP</name>
         <description>I23 Bug Target with secondary controller capability.</description>
         <value>2</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>TO_DIS</name>
       <description>Disable Timeout error.</description>
       <bitRange>[3:3]</bitRange>
       <access>read-write</access>
      </field>
      <field>
       <name>HKEEP</name>
       <description>High-keepr implementation.</description>
       <bitRange>[5:4]</bitRange>
       <access>read-write</access>
       <enumeratedValues>
        <enumeratedValue>
         <name>OFF</name>
         <description>No high-keeper support.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>ON_CHIP</name>
         <description>On-chip high-keeper support.</description>
         <value>1</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>EXT_SDA</name>
         <description>External high-keeper support for SDA.</description>
         <value>2</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>EXT_SCL_SDA</name>
         <description>External high-keeper support for SCL and SDA.</description>
         <value>3</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>OD_STOP</name>
       <description>Use open-drain speed for STOP.</description>
       <bitRange>[6:6]</bitRange>
       <access>read-write</access>
      </field>
      <field>
       <name>PP_BAUD</name>
       <description>SCL Frequency for push-pull drive.</description>
       <bitRange>[11:8]</bitRange>
       <access>read-write</access>
       <enumeratedValues>
        <enumeratedValue>
         <name>1_FCLK</name>
         <description>SCL High Period is one FCLK Period.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>2_FCLK</name>
         <description>SCL High Period is two FLCK Periods.</description>
         <value>1</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>3_FCLK</name>
         <description>SCL High Period is three FCLK Period.</description>
         <value>2</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>4_FCLK</name>
         <description>SCL High Period is four FCLK Period.</description>
         <value>3</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>5_FCLK</name>
         <description>SCL High Period is five FCLK Period.</description>
         <value>4</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>6_FCLK</name>
         <description>SCL High Period is six FCLK Period.</description>
         <value>5</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>7_FCLK</name>
         <description>SCL High Period is seven FCLK Period.</description>
         <value>6</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>8_FCLK</name>
         <description>SCL High Period is eight FCLK Period.</description>
         <value>7</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>9_FCLK</name>
         <description>SCL High Period is nine FCLK Period.</description>
         <value>8</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>10_FCLK</name>
         <description>SCL High Period is ten FCLK Period.</description>
         <value>9</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>11_FCLK</name>
         <description>SCL High Period is eleven FCLK Period.</description>
         <value>10</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>12_FCLK</name>
         <description>SCL High Period is twelve FCLK Period.</description>
         <value>11</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>13_FCLK</name>
         <description>SCL High Period is thirteen FCLK Period.</description>
         <value>12</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>14_FCLK</name>
         <description>SCL High Period is fourteen FCLK Period.</description>
         <value>13</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>15_FCLK</name>
         <description>SCL High Period is fifthteen FCLK Period.</description>
         <value>14</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>16_FCLK</name>
         <description>SCL High Period is sixteen FCLK Period.</description>
         <value>15</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>PP_ADD_LBAUD</name>
       <description>Number of FCLK periods to add to the base of SCL low period.</description>
       <bitRange>[15:12]</bitRange>
       <access>read-write</access>
       <enumeratedValues>
        <enumeratedValue>
         <name>0_FCLK</name>
         <description>Adds zero FCLK periods to the SCL low period.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>1_FCLK</name>
         <description>Adds one FCLK period to the SCL low period.</description>
         <value>1</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>2_FCLK</name>
         <description>Adds two FCLK periods to the SCL low period.</description>
         <value>2</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>3_FCLK</name>
         <description>Adds three FCLK periods to the SCL low period.</description>
         <value>3</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>4_FCLK</name>
         <description>Adds four FCLK periods to the SCL low period.</description>
         <value>4</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>5_FCLK</name>
         <description>Adds five FCLK periods to the SCL low period.</description>
         <value>5</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>6_FCLK</name>
         <description>Adds six FCLK periods to the SCL low period.</description>
         <value>6</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>7_FCLK</name>
         <description>Adds seven FCLK periods to the SCL low period.</description>
         <value>7</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>8_FCLK</name>
         <description>Adds eight FCLK periods to the SCL low period.</description>
         <value>8</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>9_FCLK</name>
         <description>Adds nine FCLK periods to the SCL low period.</description>
         <value>9</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>10_FCLK</name>
         <description>Adds ten FCLK periods to the SCL low period.</description>
         <value>10</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>11_FCLK</name>
         <description>Adds eleven FCLK periods to the SCL low period.</description>
         <value>11</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>12_FCLK</name>
         <description>Adds twelve FCLK periods to the SCL low period.</description>
         <value>12</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>13_FCLK</name>
         <description>Adds thirteen FCLK periods to the SCL low period.</description>
         <value>13</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>14_FCLK</name>
         <description>Adds fourteen FCLK periods to the SCL low period.</description>
         <value>14</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>15_FCLK</name>
         <description>Adds fifthteen FCLK periods to the SCL low period.</description>
         <value>15</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>OD_LBAUD</name>
       <description>Number of PP_BAUD periods minus 1 to make one SCL low period for I3C open-dran periods.</description>
       <bitRange>[23:16]</bitRange>
       <access>read-write</access>
      </field>
      <field>
       <name>OD_HP</name>
       <description>Controls SCL high period for I3C oepn-drain operation.</description>
       <bitRange>[24:24]</bitRange>
       <access>read-write</access>
      </field>
      <field>
       <name>PP_SKEW</name>
       <description>Number of FCLK periods to delay the SDA value change from the SCL edge for I3C push-pull operation.</description>
       <bitRange>[27:25]</bitRange>
       <access>read-write</access>
      </field>
      <field>
       <name>I2C_BAUD</name>
       <description>Detyermines SCL high and low pweriods for I2C mode, in units of OD_BAUD period.</description>
       <bitRange>[31:28]</bitRange>
       <access>read-write</access>
      </field>
     </fields>
    </register>
    <register>
     <name>TARG_CTRL0</name>
     <description>Target Control 0 (Configuration) Register.</description>
     <addressOffset>0x004</addressOffset>
     <fields>
      <field>
       <name>EN</name>
       <description>Target device enable.</description>
       <bitRange>[0:0]</bitRange>
       <access>read-write</access>
      </field>
      <field>
       <name>MATCHSS</name>
       <description>Match STOP and START.</description>
       <bitRange>[2:2]</bitRange>
       <access>read-write</access>
      </field>
      <field>
       <name>TO_IGN</name>
       <description>Ignore Timeout Errors.</description>
       <bitRange>[3:3]</bitRange>
       <access>read-write</access>
      </field>
      <field>
       <name>OFFLINE</name>
       <description>Rejoin I3C bus with existing dynamic address.</description>
       <bitRange>[9:9]</bitRange>
       <access>read-write</access>
      </field>
     </fields>
    </register>
    <register>
     <name>TARG_STATUS</name>
     <description>Target Status Register.</description>
     <addressOffset>0x008</addressOffset>
     <fields>
      <field>
       <name>BUSY</name>
       <description>Not stopped.</description>
       <bitRange>[0:0]</bitRange>
       <access>read-only</access>
      </field>
      <field>
       <name>LIST_RESP</name>
       <description>Message status - listening/responding or not.</description>
       <bitRange>[1:1]</bitRange>
       <access>read-only</access>
      </field>
      <field>
       <name>CCCH</name>
       <description>CCC is being handled.</description>
       <bitRange>[2:2]</bitRange>
       <access>read-only</access>
      </field>
      <field>
       <name>RX_SDR</name>
       <description>SDR Read.</description>
       <bitRange>[3:3]</bitRange>
      </field>
      <field>
       <name>TX_SDR</name>
       <description>SDR Write.</description>
       <bitRange>[4:4]</bitRange>
      </field>
      <field>
       <name>DAA</name>
       <description>Dynamic Address Assignment Mode.</description>
       <bitRange>[5:5]</bitRange>
       <access>read-only</access>
      </field>
      <field>
       <name>HDR</name>
       <description>HDR Mode.</description>
       <bitRange>[6:6]</bitRange>
       <access>read-only</access>
      </field>
      <field>
       <name>START</name>
       <description>START Detected.</description>
       <bitRange>[8:8]</bitRange>
       <access>read-write</access>
      </field>
      <field>
       <name>ADDRMATCH</name>
       <description>Address Matched.</description>
       <bitRange>[9:9]</bitRange>
       <access>read-write</access>
      </field>
      <field>
       <name>STOP</name>
       <description>STOP Detected.</description>
       <bitRange>[10:10]</bitRange>
       <access>read-write</access>
      </field>
      <field>
       <name>RX_RDY</name>
       <description>Receive data ready.</description>
       <bitRange>[11:11]</bitRange>
       <access>read-only</access>
      </field>
      <field>
       <name>TX_NFULL</name>
       <description>TX FIFO is not full, ready to accept more data.</description>
       <bitRange>[12:12]</bitRange>
       <access>read-write</access>
      </field>
      <field>
       <name>DYNADDR_CHG</name>
       <description>Dynamic address changed.</description>
       <bitRange>[13:13]</bitRange>
       <access>read-write</access>
      </field>
      <field>
       <name>CCC</name>
       <description>CCC received.</description>
       <bitRange>[14:14]</bitRange>
       <access>read-write</access>
      </field>
      <field>
       <name>ERRWARN</name>
       <description>An error or warning has occurred.</description>
       <bitRange>[15:15]</bitRange>
       <access>read-only</access>
      </field>
      <field>
       <name>CCCH_DONE</name>
       <description>CCC Handled.</description>
       <bitRange>[17:17]</bitRange>
       <access>read-write</access>
      </field>
      <field>
       <name>EVENT_REQ</name>
       <description>Event Requested.</description>
       <bitRange>[18:18]</bitRange>
       <access>read-write</access>
      </field>
      <field>
       <name>TARG_RST</name>
       <description>Target Reset.</description>
       <bitRange>[19:19]</bitRange>
       <access>read-write</access>
      </field>
      <field>
       <name>EVENT</name>
       <description>Event Status.</description>
       <bitRange>[21:20]</bitRange>
       <access>read-only</access>
       <enumeratedValues>
        <enumeratedValue>
         <name>NONE</name>
         <description>No event.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>REQ_PEND</name>
         <description>Request not yet sent.</description>
         <value>1</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>REQ_NACK</name>
         <description>Request was sent and NACKed and will be tried again.</description>
         <value>2</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>REQ_ACK</name>
         <description>Request was sent and ACKed.</description>
         <value>3</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>IBI_DIS</name>
       <description>Indicates whether IBI events are disabled.</description>
       <bitRange>[24:24]</bitRange>
       <access>read-only</access>
      </field>
      <field>
       <name>CONTREQ_DIS</name>
       <description>Indicates whether bus controller request events are disabled.</description>
       <bitRange>[25:25]</bitRange>
       <access>read-only</access>
      </field>
      <field>
       <name>HJ_DIS</name>
       <description>Indicates whether Hot-Joinevents are disabled.</description>
       <bitRange>[27:27]</bitRange>
       <access>read-only</access>
      </field>
      <field>
       <name>ACTSTATE</name>
       <description>Holds the current activity state.</description>
       <bitRange>[29:28]</bitRange>
       <access>read-only</access>
       <enumeratedValues>
        <enumeratedValue>
         <name>NORMAL</name>
         <description>No latency, normal bus operation.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>1MS_LAT</name>
         <description>1 ms latency.</description>
         <value>1</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>100MS_LAT</name>
         <description>100 ms latency.</description>
         <value>2</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>10S_LAT</name>
         <description>10 s latency.</description>
         <value>3</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>TIMECTRL</name>
       <description>Time Control mode.</description>
       <bitRange>[31:30]</bitRange>
       <access>read-only</access>
       <enumeratedValues>
        <enumeratedValue>
         <name>DIS</name>
         <description>No timing control mode is enabled.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>SYNC</name>
         <description>Synchronous Mode is enabled.</description>
         <value>1</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>ASYNC</name>
         <description>Asynchronous Mode is enabled.</description>
         <value>2</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>BOTH</name>
         <description>Both synchronous and asynchronous modes are enabled.</description>
         <value>3</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
     </fields>
    </register>
    <register>
     <name>TARG_CTRL1</name>
     <description>Target Control 1 Register.</description>
     <addressOffset>0x00C</addressOffset>
     <fields>
      <field>
       <name>EVENT</name>
       <description>Sets respecive I3C target event request.</description>
       <bitRange>[1:0]</bitRange>
       <access>read-write</access>
       <enumeratedValues>
        <enumeratedValue>
         <name>NORMAL</name>
         <description>Normal mode.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>IBI</name>
         <description>Generate an IBI on the I3C bus.</description>
         <value>1</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>CONTREQ</name>
         <description>Request control of the I3C bus.</description>
         <value>2</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>HJ</name>
         <description>Generate a Hot-Join request.</description>
         <value>3</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>EXTIBI</name>
       <description>Indicates there are extended IBI data bytes.</description>
       <bitRange>[3:3]</bitRange>
       <access>read-write</access>
      </field>
      <field>
       <name>DYNADDR_IDX</name>
       <description>Index of dynamic address for the current IBI request.</description>
       <bitRange>[7:4]</bitRange>
       <access>read-write</access>
      </field>
      <field>
       <name>IBIDATA</name>
       <description>Contains the mandatory data byte to be sent when generating an IBI.</description>
       <bitRange>[15:8]</bitRange>
       <access>read-write</access>
      </field>
     </fields>
    </register>
    <register>
     <name>TARG_INTEN</name>
     <description>Target Interrupt Enable Register.</description>
     <addressOffset>0x010</addressOffset>
     <access>read-write</access>
     <fields>
      <field>
       <name>START</name>
       <description>START detected.</description>
       <bitRange>[8:8]</bitRange>
      </field>
      <field>
       <name>ADDRMATCH</name>
       <description>Address matched interrupt.</description>
       <bitRange>[9:9]</bitRange>
      </field>
      <field>
       <name>STOP</name>
       <description>STOP detected.</description>
       <bitRange>[10:10]</bitRange>
      </field>
      <field>
       <name>RX_RDY</name>
       <description>Receive data ready.</description>
       <bitRange>[11:11]</bitRange>
      </field>
      <field>
       <name>TX_NFULL</name>
       <description>Ready for transmit data,</description>
       <bitRange>[12:12]</bitRange>
      </field>
      <field>
       <name>DYNADDR_CHG</name>
       <description>Dynamic Address Changed interrupt enable.</description>
       <bitRange>[13:13]</bitRange>
      </field>
      <field>
       <name>CCC</name>
       <description>CCC Reveived Interrupt.</description>
       <bitRange>[14:14]</bitRange>
      </field>
      <field>
       <name>ERRWARN</name>
       <description>Error or warning interrupt.</description>
       <bitRange>[15:15]</bitRange>
      </field>
      <field>
       <name>CCCH_DONE</name>
       <description>CCC Handled Interrupt.</description>
       <bitRange>[17:17]</bitRange>
      </field>
      <field>
       <name>EVENT_REQ</name>
       <description>Event Reqeusted Interrupt.</description>
       <bitRange>[18:18]</bitRange>
      </field>
      <field>
       <name>TARG_RST</name>
       <description>I3C Target Reset Interrupt.</description>
       <bitRange>[19:19]</bitRange>
      </field>
     </fields>
    </register>
