analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32657/Include/max32657.svd
    <register>
     <name>TARG_INTCLR</name>
     <description>Target Interrupt Clear Register.</description>
     <addressOffset>0x014</addressOffset>
     <access>write-only</access>
     <fields>
      <field>
       <name>START</name>
       <description>START detected.</description>
       <bitRange>[8:8]</bitRange>
      </field>
      <field>
       <name>ADDRMATCH</name>
       <description>Address matched interrupt.</description>
       <bitRange>[9:9]</bitRange>
      </field>
      <field>
       <name>STOP</name>
       <description>STOP detected.</description>
       <bitRange>[10:10]</bitRange>
      </field>
      <field>
       <name>RX_RDY</name>
       <description>Receive data ready.</description>
       <bitRange>[11:11]</bitRange>
      </field>
      <field>
       <name>TX_NFULL</name>
       <description>Ready for transmit data,</description>
       <bitRange>[12:12]</bitRange>
      </field>
      <field>
       <name>DYNADDR_CHG</name>
       <description>Dynamic Address Changed interrupt enable.</description>
       <bitRange>[13:13]</bitRange>
      </field>
      <field>
       <name>CCC</name>
       <description>CCC Reveived Interrupt.</description>
       <bitRange>[14:14]</bitRange>
      </field>
      <field>
       <name>ERRWARN</name>
       <description>Error or warning interrupt.</description>
       <bitRange>[15:15]</bitRange>
      </field>
      <field>
       <name>CCCH_DONE</name>
       <description>CCC Handled Interrupt.</description>
       <bitRange>[17:17]</bitRange>
      </field>
      <field>
       <name>EVENT_REQ</name>
       <description>Event Reqeusted Interrupt.</description>
       <bitRange>[18:18]</bitRange>
      </field>
      <field>
       <name>TARG_RST</name>
       <description>I3C Target Reset Interrupt.</description>
       <bitRange>[19:19]</bitRange>
      </field>
     </fields>
    </register>
    <register>
     <name>TARG_INTFL</name>
     <description>Target Interrupt Flag Register.</description>
     <addressOffset>0x018</addressOffset>
     <access>read-only</access>
     <fields>
      <field>
       <name>START</name>
       <description>START detected.</description>
       <bitRange>[8:8]</bitRange>
      </field>
      <field>
       <name>ADDRMATCH</name>
       <description>Address matched interrupt.</description>
       <bitRange>[9:9]</bitRange>
      </field>
      <field>
       <name>STOP</name>
       <description>STOP detected.</description>
       <bitRange>[10:10]</bitRange>
      </field>
      <field>
       <name>RX_RDY</name>
       <description>Receive data ready.</description>
       <bitRange>[11:11]</bitRange>
      </field>
      <field>
       <name>TX_NFULL</name>
       <description>Ready for transmit data,</description>
       <bitRange>[12:12]</bitRange>
      </field>
      <field>
       <name>DYNADDR_CHG</name>
       <description>Dynamic Address Changed interrupt enable.</description>
       <bitRange>[13:13]</bitRange>
      </field>
      <field>
       <name>CCC</name>
       <description>CCC Reveived Interrupt.</description>
       <bitRange>[14:14]</bitRange>
      </field>
      <field>
       <name>ERRWARN</name>
       <description>Error or warning interrupt.</description>
       <bitRange>[15:15]</bitRange>
      </field>
      <field>
       <name>CCCH_DONE</name>
       <description>CCC Handled Interrupt.</description>
       <bitRange>[17:17]</bitRange>
      </field>
      <field>
       <name>EVENT_REQ</name>
       <description>Event Reqeusted Interrupt.</description>
       <bitRange>[18:18]</bitRange>
      </field>
      <field>
       <name>TARG_RST</name>
       <description>I3C Target Reset Interrupt.</description>
       <bitRange>[19:19]</bitRange>
      </field>
     </fields>
    </register>
    <register>
     <name>TARG_ERRWARN</name>
     <description>Target Error and Warning Register.</description>
     <addressOffset>0x01C</addressOffset>
     <access>read-write</access>
     <fields>
      <field>
       <name>OVR</name>
       <description>Internal FIFO overrun flag.</description>
       <bitRange>[0:0]</bitRange>
      </field>
      <field>
       <name>UNR</name>
       <description>Internal FIFO underrun flag.</description>
       <bitRange>[1:1]</bitRange>
      </field>
      <field>
       <name>UNR_NACK</name>
       <description>I3C or I2C mode address emitted by the IP was NACKed by the targets.</description>
       <bitRange>[2:2]</bitRange>
      </field>
      <field>
       <name>CONT_RX_TERM</name>
       <description>Controller terminated read in message mode.</description>
       <bitRange>[3:3]</bitRange>
      </field>
      <field>
       <name>INVSTART</name>
       <description>Invalid START.</description>
       <bitRange>[4:4]</bitRange>
      </field>
      <field>
       <name>SDR_PAR</name>
       <description>SDR Parity Error.</description>
       <bitRange>[8:8]</bitRange>
      </field>
      <field>
       <name>TO</name>
       <description>Timeout Error.</description>
       <bitRange>[11:11]</bitRange>
      </field>
      <field>
       <name>RX_UNR</name>
       <description>Read data underrun.</description>
       <bitRange>[16:16]</bitRange>
      </field>
      <field>
       <name>TX_OVR</name>
       <description>Write data overrun.</description>
       <bitRange>[17:17]</bitRange>
      </field>
     </fields>
    </register>
    <register>
     <name>TARG_DMACTRL</name>
     <description>Target DMA Control Register.</description>
     <addressOffset>0x020</addressOffset>
     <access>read-write</access>
     <fields>
      <field>
       <name>RX_EN</name>
       <description>DMA read enable.</description>
       <bitRange>[1:0]</bitRange>
       <enumeratedValues>
        <enumeratedValue>
         <name>DIS</name>
         <description>Disable DMA.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>ONE_FR</name>
         <description>Enable DMA for one frame.</description>
         <value>1</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>EN</name>
         <description>Enable DMA until disabled by setting this field to 0b00.</description>
         <value>2</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>TX_EN</name>
       <description>DMA write enable.</description>
       <bitRange>[3:2]</bitRange>
       <enumeratedValues>
        <enumeratedValue>
         <name>DIS</name>
         <description>Disable DMA.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>ONE_FR</name>
         <description>Enable DMA for one frame.</description>
         <value>1</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>EN</name>
         <description>Enable DMA until disabled by setting this field to 0b00.</description>
         <value>2</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>WIDTH</name>
       <description>Selects the data width for DMA transfers.</description>
       <bitRange>[5:4]</bitRange>
       <enumeratedValues>
        <enumeratedValue>
         <name>BYTE</name>
         <description>Byte size.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>HALFWORD</name>
         <description>Halfword size.</description>
         <value>2</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
     </fields>
    </register>
    <register>
     <name>TARG_FIFOCTRL</name>
     <description>Target FIFO Control Register.</description>
     <addressOffset>0x02C</addressOffset>
     <fields>
      <field>
       <name>TX_FLUSH</name>
       <description>Flush TX FIFO.</description>
       <bitRange>[0:0]</bitRange>
       <access>write-only</access>
      </field>
      <field>
       <name>RX_FLUSH</name>
       <description>Flush RX FIFO.</description>
       <bitRange>[1:1]</bitRange>
       <access>write-only</access>
      </field>
      <field>
       <name>UNLOCK</name>
       <description>Unlock FIFO Triggers.</description>
       <bitRange>[3:3]</bitRange>
       <access>write-only</access>
      </field>
      <field>
       <name>TX_THD_LVL</name>
       <description>TX FIFO trigger level.</description>
       <bitRange>[5:4]</bitRange>
       <access>read-write</access>
       <enumeratedValues>
        <enumeratedValue>
         <name>EMPTY</name>
         <description>Trigger when empty.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>QUARTER_FULL</name>
         <description>Trigger when quarter full or less.</description>
         <value>1</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>HALF_FULL</name>
         <description>Trigger when half full or less.</description>
         <value>2</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>ALMOST_FULL</name>
         <description>Trigger when almost full or less.</description>
         <value>3</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>RX_THD_LVL</name>
       <description>RX FIFO trigger level.</description>
       <bitRange>[7:6]</bitRange>
       <access>read-write</access>
       <enumeratedValues>
        <enumeratedValue>
         <name>NOT_EMPTY</name>
         <description>Trigger when empty.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>QUARTER_FULL</name>
         <description>Trigger when quarter full or less.</description>
         <value>1</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>HALF_FULL</name>
         <description>Trigger when half full or less.</description>
         <value>2</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>3_QUARTER_FULL</name>
         <description>Trigger when 3 quarters full or less.</description>
         <value>3</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>TX_LVL</name>
       <description>Number of messages in TX FIFO.</description>
       <bitRange>[21:16]</bitRange>
       <access>read-only</access>
      </field>
      <field>
       <name>RX_LVL</name>
       <description>Number of messages in RX FIFO.</description>
       <bitRange>[29:24]</bitRange>
       <access>read-only</access>
      </field>
      <field>
       <name>TX_FULL</name>
       <description>TX FIFO Full flag.</description>
       <bitRange>[30:30]</bitRange>
       <access>read-only</access>
      </field>
      <field>
       <name>RX_EM</name>
       <description>RX FIFO Empty Flag.</description>
       <bitRange>[31:31]</bitRange>
       <access>read-only</access>
      </field>
     </fields>
    </register>
    <register>
     <name>TARG_TXFIFO8</name>
     <description>Target Write Byte Data Register.</description>
     <addressOffset>0x030</addressOffset>
     <access>write-only</access>
     <fields>
      <field>
       <name>DATA</name>
       <description>Data byte to send.</description>
       <bitRange>[7:0]</bitRange>
      </field>
      <field>
       <name>END</name>
       <description>End of data.</description>
       <bitRange>[8:8]</bitRange>
      </field>
      <field>
       <name>END2</name>
       <description>End of data.</description>
       <bitRange>[16:16]</bitRange>
      </field>
     </fields>
    </register>
    <register>
     <name>TARG_TXFIFO8E</name>
     <description>Target Write Byte Data as End Register.</description>
     <addressOffset>0x034</addressOffset>
     <access>write-only</access>
     <fields>
      <field>
       <name>DATA</name>
       <description>Data is read from or written to this location. Transmit and receive FIFO are separate but both are addressed at this location.</description>
       <bitRange>[7:0]</bitRange>
      </field>
     </fields>
    </register>
    <register>
     <name>TARG_TXFIFO16</name>
     <description>Target Write Half-Word Data Register.</description>
     <addressOffset>0x038</addressOffset>
     <access>write-only</access>
     <fields>
      <field>
       <name>DATA</name>
       <description>Data halfword to send.</description>
       <bitRange>[15:0]</bitRange>
      </field>
      <field>
       <name>END</name>
       <description>End of data.</description>
       <bitRange>[16:16]</bitRange>
      </field>
     </fields>
    </register>
    <register>
     <name>TARG_TXFIFO16E</name>
     <description>Target Write Half-Word Data as End Register.</description>
     <addressOffset>0x03C</addressOffset>
     <access>write-only</access>
     <fields>
      <field>
       <name>DATA</name>
       <description>Data halfword to send.</description>
       <bitRange>[15:0]</bitRange>
      </field>
     </fields>
    </register>
    <register>
     <name>TARG_RXFIFO8</name>
     <description>Target Read Byte Data Register.</description>
     <addressOffset>0x040</addressOffset>
     <access>read-only</access>
     <fields>
      <field>
       <name>DATA</name>
       <description>Read data byte from RX FIFO.</description>
       <bitRange>[7:0]</bitRange>
      </field>
     </fields>
    </register>
    <register>
     <name>TARG_RXFIFO16</name>
     <description>Target Read Half-Word Data Register.</description>
     <addressOffset>0x048</addressOffset>
     <access>read-only</access>
     <fields>
      <field>
       <name>DATA</name>
       <description>Read data hyalfword from RX FIFO.</description>
       <bitRange>[15:0]</bitRange>
      </field>
     </fields>
    </register>
    <register>
     <name>TARG_TXFIFO8O</name>
     <description>Target Byte-Only Write Byte Data Register.</description>
     <addressOffset>0x054</addressOffset>
     <access>write-only</access>
     <fields>
      <field>
       <name>DATA</name>
       <description>Data byte to send.</description>
       <bitRange>[7:0]</bitRange>
      </field>
     </fields>
    </register>
    <register>
     <name>TARG_CAP0</name>
     <description>Target Capabilities 0 Register.</description>
     <addressOffset>0x05C</addressOffset>
     <access>read-only</access>
     <fields>
      <field>
       <name>MAPCNT</name>
       <description>Number of mapped target addresses supported.</description>
       <bitRange>[3:0]</bitRange>
      </field>
      <field>
       <name>I2C_10BADDR</name>
       <description>I2C 10-bit address support.</description>
       <bitRange>[4:4]</bitRange>
      </field>
      <field>
       <name>I2C_SWRST</name>
       <description>I2C Software Reset Support.</description>
       <bitRange>[5:5]</bitRange>
      </field>
      <field>
       <name>I2C_DEVID</name>
       <description>I2C Device ID Support.</description>
       <bitRange>[6:6]</bitRange>
      </field>
      <field>
       <name>FIFO32_REG</name>
       <description>FIFO 32 registers available.</description>
       <bitRange>[7:7]</bitRange>
      </field>
      <field>
       <name>EXTIBI</name>
       <description>Extended IBI data support.</description>
       <bitRange>[8:8]</bitRange>
      </field>
      <field>
       <name>EXTIBI_REG</name>
       <description>Extended IBI data register support.</description>
       <bitRange>[9:9]</bitRange>
      </field>
      <field>
       <name>HDRBT_LANES</name>
       <description>Multi-lane support for HDR-BT mode.</description>
       <bitRange>[13:12]</bitRange>
      </field>
      <field>
       <name>CCC_V1_1</name>
       <description>CCC V1.1 Support.</description>
       <bitRange>[16:16]</bitRange>
      </field>
      <field>
       <name>TARG_RST</name>
       <description>Target Reset Support.</description>
       <bitRange>[17:17]</bitRange>
      </field>
      <field>
       <name>GROUPADDR</name>
       <description>Group address support.</description>
       <bitRange>[19:18]</bitRange>
      </field>
      <field>
       <name>AASA_CCC</name>
       <description>SETAASA CCC Support.</description>
       <bitRange>[21:21]</bitRange>
      </field>
      <field>
       <name>T2T_SUBSC</name>
       <description>Target-to-target subscriber support.</description>
       <bitRange>[22:22]</bitRange>
      </field>
      <field>
       <name>T2T_WR</name>
       <description>Target-to-target write support.</description>
       <bitRange>[23:23]</bitRange>
      </field>
     </fields>
    </register>
    <register>
     <name>TARG_CAP1</name>
     <description>TARG_Capabilities 1 Register.</description>
     <addressOffset>0x060</addressOffset>
     <access>read-only</access>
     <fields>
      <field>
       <name>PROVID</name>
       <description>Provisioned ID implementation.</description>
       <bitRange>[1:0]</bitRange>
      </field>
      <field>
       <name>PROVID_REG</name>
       <description>Provision ID, Bus Characteristics, Device Characteristics implementation.</description>
       <bitRange>[5:2]</bitRange>
      </field>
      <field>
       <name>HDR_MODES</name>
       <description>Supported HDR modes.</description>
       <bitRange>[8:6]</bitRange>
      </field>
      <field>
       <name>CONT</name>
       <description>Controller mode capable.</description>
       <bitRange>[9:9]</bitRange>
      </field>
      <field>
       <name>STATADDR</name>
       <description>I2C-style static address implementation.</description>
       <bitRange>[11:10]</bitRange>
      </field>
      <field>
       <name>CCCH</name>
       <description>CCC Handled by IP.</description>
       <bitRange>[15:12]</bitRange>
       <enumeratedValues>
        <enumeratedValue>
         <name>BASIC</name>
         <description>Basic CCCs.</description>
         <value>1</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>LIMITS</name>
         <description>CCCs related to maximum transfer lengths and speed.</description>
         <value>2</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>INTACT</name>
         <description>Pending Interrupt and Activity Mode fields of GETSTATUS CCC.</description>
         <value>4</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>VENDOR</name>
         <description>Vendor Reserved field of GETSTATUS CCC.</description>
         <value>8</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>IBI_EVENTS</name>
       <description>Supported IBI events.</description>
       <bitRange>[20:16]</bitRange>
       <enumeratedValues>
        <enumeratedValue>
         <name>IBI</name>
         <description>IBI support.</description>
         <value>1</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>PAYLOAD</name>
         <description>IBI has payload.</description>
         <value>2</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>CONTREQ</name>
         <description>Controller request support.</description>
         <value>4</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>HJ</name>
         <description>Hot-Join support.</description>
         <value>8</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>BAMATCH</name>
         <description>Use BAMATCH field of CONFIG register to measure 1us Bus Available timing.</description>
         <value>16</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>TIMECTRL</name>
       <description>Timing Control Support.</description>
       <bitRange>[21:21]</bitRange>
      </field>
      <field>
       <name>EXTFIFO</name>
       <description>External FIFO configuration.</description>
       <bitRange>[25:23]</bitRange>
      </field>
      <field>
       <name>TXFIFO_CFG</name>
       <description>TX FIFO configuration.</description>
       <bitRange>[27:26]</bitRange>
      </field>
      <field>
       <name>RXFIFO_CFG</name>
       <description>RX FIFO configuration.</description>
       <bitRange>[29:28]</bitRange>
      </field>
      <field>
       <name>INTR</name>
       <description>Interrupt support.</description>
       <bitRange>[30:30]</bitRange>
      </field>
      <field>
       <name>DMA</name>
       <description>DMA support.</description>
       <bitRange>[31:31]</bitRange>
      </field>
     </fields>
    </register>
    <register>
     <name>TARG_DYNADDR</name>
     <description>Target Dynamic Address Register.</description>
     <addressOffset>0x064</addressOffset>
     <access>read-write</access>
     <fields>
      <field>
       <name>VALID</name>
       <description>Address valid check.</description>
       <bitRange>[0:0]</bitRange>
      </field>
      <field>
       <name>ADDR</name>
       <description>The assigned dynamic address.</description>
       <bitRange>[7:1]</bitRange>
      </field>
      <field>
       <name>CAUSE</name>
       <description>Indicates how the last primary dynnamic address value change occurred.</description>
       <bitRange>[10:8]</bitRange>
      </field>
     </fields>
    </register>
    <register>
     <name>TARG_MAXLIMITS</name>
     <description>Maximum Limits Register.</description>
     <addressOffset>0x068</addressOffset>
     <access>read-write</access>
     <fields>
      <field>
       <name>RX</name>
       <description>The maximum number of bytes that the I3C controller may read from this I3C target device per message.</description>
       <bitRange>[11:0]</bitRange>
      </field>
      <field>
       <name>TX</name>
       <description>The maximum number of bytes that the I3C controller may write from this I3C target device per message.</description>
       <bitRange>[27:16]</bitRange>
      </field>
     </fields>
    </register>
    <register>
     <name>TARG_IDEXT</name>
     <description>ID Extension Register.</description>
     <addressOffset>0x070</addressOffset>
     <access>read-write</access>
     <fields>
      <field>
       <name>DEVCHAR</name>
       <description>Device Characteristics Register.</description>
       <bitRange>[15:8]</bitRange>
      </field>
      <field>
       <name>BUSCHAR</name>
       <description>Bus Characteristics Register.</description>
       <bitRange>[23:16]</bitRange>
      </field>
     </fields>
    </register>
