analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32657/Include/max32657.svd
    <register>
     <name>TARG_MSGLAST</name>
     <description>Target Matching Address Index Register.</description>
     <addressOffset>0x07C</addressOffset>
     <access>read-only</access>
     <fields>
      <field>
       <name>IDX</name>
       <description>Index or group number of last matched address.</description>
       <bitRange>[3:0]</bitRange>
      </field>
      <field>
       <name>STATADDR</name>
       <description>Last matched address was a I2C static address.</description>
       <bitRange>[4:4]</bitRange>
      </field>
      <field>
       <name>GROUP</name>
       <description>Last matched address was a group address.</description>
       <bitRange>[5:5]</bitRange>
      </field>
      <field>
       <name>MODE</name>
       <description>Indicates the mode of the last access.</description>
       <bitRange>[7:6]</bitRange>
       <enumeratedValues>
        <enumeratedValue>
         <name>DYN_STAT_ADDR</name>
         <description>I3C SDR or I2C</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>HDR_DDR</name>
         <description>HDR-DDR.</description>
         <value>1</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>HDR_BT</name>
         <description>HDR-BT.</description>
         <value>2</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>PREV_IDX</name>
       <description>Index or group number of previous matched address.</description>
       <bitRange>[11:8]</bitRange>
      </field>
      <field>
       <name>PREV_GROUP</name>
       <description>Last matched address was a previous group address.</description>
       <bitRange>[13:13]</bitRange>
      </field>
      <field>
       <name>PREV_MODE</name>
       <description>Indicates the mode of the previous access.</description>
       <bitRange>[15:14]</bitRange>
       <enumeratedValues>
        <enumeratedValue>
         <name>DYN_STAT_ADDR</name>
         <description>I3C SDR or I2C</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>HDR_DDR</name>
         <description>HDR-DDR.</description>
         <value>1</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>HDR_BT</name>
         <description>HDR-BT.</description>
         <value>2</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>SECPREV_IDX</name>
       <description>Index or group number of secondary previous matched address.</description>
       <bitRange>[19:16]</bitRange>
      </field>
      <field>
       <name>SECPREV_GROUP</name>
       <description>Last matched address was a secondary previous group address.</description>
       <bitRange>[21:21]</bitRange>
      </field>
      <field>
       <name>SECPREV_MODE</name>
       <description>Indicates the mode of the secondary previous access.</description>
       <bitRange>[23:22]</bitRange>
       <enumeratedValues>
        <enumeratedValue>
         <name>DYN_STAT_ADDR</name>
         <description>I3C SDR or I2C</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>HDR_DDR</name>
         <description>HDR-DDR.</description>
         <value>1</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>HDR_BT</name>
         <description>HDR-BT.</description>
         <value>2</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
     </fields>
    </register>
    <register>
     <name>CONT_CTRL1</name>
     <description>Controller Control 1 Register.</description>
     <addressOffset>0x084</addressOffset>
     <fields>
      <field>
       <name>REQ</name>
       <description>Requests an I3C or I2C bus operation.</description>
       <bitRange>[2:0]</bitRange>
       <access>read-write</access>
       <enumeratedValues>
        <enumeratedValue>
         <name>NONE</name>
         <description>None operation.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>EMIT_START</name>
         <description>Emit a START with address and read-write bit from stopped state or in the middle of an SDR message.</description>
         <value>1</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>EMIT_STOP</name>
         <description>Emit a STOP.</description>
         <value>2</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>IBI_ACKNACK</name>
         <description>Manually ACK or NACK an IBI.</description>
         <value>3</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>PROCESS_DAA</name>
         <description>Process Dynamic Address Assignment.</description>
         <value>4</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>EXIT_RST</name>
         <description>Emit HDR Exit Pattern or Target Reset pattern.</description>
         <value>6</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>AUTO_IBI</name>
         <description>Automatic IBI response.</description>
         <value>7</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>TYPE</name>
       <description>Controls type of operation for REQ field.</description>
       <bitRange>[5:4]</bitRange>
       <access>read-write</access>
      </field>
      <field>
       <name>IBIRESP</name>
       <description>Response to use when an IBI occurs.</description>
       <bitRange>[7:6]</bitRange>
       <access>read-write</access>
      </field>
      <field>
       <name>RDWR_DIR</name>
       <description>Direction of the transfer.</description>
       <bitRange>[8:8]</bitRange>
       <access>read-write</access>
      </field>
      <field>
       <name>ADDR</name>
       <description>Address to send with START.</description>
       <bitRange>[15:9]</bitRange>
       <access>read-write</access>
      </field>
      <field>
       <name>TERM_RD</name>
       <description>Termination count for read.</description>
       <bitRange>[23:16]</bitRange>
       <access>read-write</access>
      </field>
     </fields>
    </register>
    <register>
     <name>CONT_STATUS</name>
     <description>Controller Status Register.</description>
     <addressOffset>0x088</addressOffset>
     <fields>
      <field>
       <name>STATE</name>
       <description>Current working state.</description>
       <bitRange>[2:0]</bitRange>
       <access>read-only</access>
       <enumeratedValues>
        <enumeratedValue>
         <name>IDLE</name>
         <description>Bus Idle.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>TARG_REQ</name>
         <description>I3C Bus i stopped and a target is holding SDA low.</description>
         <value>1</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>SDR_TXSDRMSG</name>
         <description>SDR Message Mode using SDRMSG registers.</description>
         <value>2</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>SDR_NORM</name>
         <description>Normal SDR message mode.</description>
         <value>3</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>DDR</name>
         <description>DDR Message mode</description>
         <value>4</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>DAA</name>
         <description>Dynamic Address Assignment mode.</description>
         <value>5</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>IBI_ACKNACK</name>
         <description>IP is waiting for the application to provide an ACK or NACK decision.</description>
         <value>6</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>IBI_RX</name>
         <description>IP is receiving an IBI.</description>
         <value>7</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>WAIT</name>
       <description>Depending on STATE, WAIT is 1 when it's waiting in an intermediary state.</description>
       <bitRange>[4:4]</bitRange>
       <access>read-only</access>
      </field>
      <field>
       <name>NACK</name>
       <description>Address was NACKed.</description>
       <bitRange>[5:5]</bitRange>
       <access>read-only</access>
      </field>
      <field>
       <name>IBITYPE</name>
       <description>The type of event for which arbitration was last won.</description>
       <bitRange>[7:6]</bitRange>
       <enumeratedValues>
        <enumeratedValue>
         <name>NONE</name>
         <description>None.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>IBI</name>
         <description>In-band Interrupt.</description>
         <value>1</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>CONT_REQ</name>
         <description>Controller request.</description>
         <value>2</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>HOTJOIN_REQ</name>
         <description>Hot-Join request.</description>
         <value>3</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>TARG_START</name>
       <description>Target START detected.</description>
       <bitRange>[8:8]</bitRange>
      </field>
      <field>
       <name>REQ_DONE</name>
       <description>CTRL1 Request completed.</description>
       <bitRange>[9:9]</bitRange>
       <access>read-only</access>
      </field>
      <field>
       <name>DONE</name>
       <description>Message completed.</description>
       <bitRange>[10:10]</bitRange>
       <access>read-write</access>
      </field>
      <field>
       <name>RX_RDY</name>
       <description>Receive data ready.</description>
       <bitRange>[11:11]</bitRange>
       <access>read-only</access>
      </field>
      <field>
       <name>TX_NFULL</name>
       <description>TX FIFO Not Full flag.</description>
       <bitRange>[12:12]</bitRange>
       <access>read-only</access>
      </field>
      <field>
       <name>IBI_WON</name>
       <description>IBI Arbitration won.</description>
       <bitRange>[13:13]</bitRange>
       <access>read-write</access>
      </field>
      <field>
       <name>ERRWARN</name>
       <description>Error or warning status.</description>
       <bitRange>[15:15]</bitRange>
       <access>read-only</access>
      </field>
      <field>
       <name>CONT_TRANS</name>
       <description>IP transitioned from I3C target to controller.</description>
       <bitRange>[19:19]</bitRange>
       <access>read-write</access>
      </field>
      <field>
       <name>IBI_ADDR</name>
       <description>The address of a received IBI or dcontroller request.</description>
       <bitRange>[30:24]</bitRange>
       <access>read-only</access>
      </field>
     </fields>
    </register>
    <register>
     <name>CONT_IBIRULES</name>
     <description>Controller IBI Registry and Rules Register.</description>
     <addressOffset>0x08C</addressOffset>
     <fields>
      <field>
       <name>ADDR0</name>
       <description>Target 0 dynamic address.</description>
       <bitRange>[5:0]</bitRange>
       <access>read-write</access>
      </field>
      <field>
       <name>ADDR1</name>
       <description>Target 1 dynamic address.</description>
       <bitRange>[11:6]</bitRange>
       <access>read-write</access>
      </field>
      <field>
       <name>ADDR2</name>
       <description>Target 2 dynamic address.</description>
       <bitRange>[17:12]</bitRange>
       <access>read-write</access>
      </field>
      <field>
       <name>ADDR3</name>
       <description>Target 3 dynamic address.</description>
       <bitRange>[23:18]</bitRange>
       <access>read-write</access>
      </field>
      <field>
       <name>ADDR4</name>
       <description>Target 4 dynamic address.</description>
       <bitRange>[29:24]</bitRange>
       <access>read-write</access>
      </field>
      <field>
       <name>MSB0</name>
       <description>Implementation of MSb for I3C dynamic addresses.</description>
       <bitRange>[30:30]</bitRange>
       <access>read-write</access>
      </field>
      <field>
       <name>NOBYTE</name>
       <description>Specifies the function of ADDR0 to ADDR4</description>
       <bitRange>[31:31]</bitRange>
       <access>read-write</access>
      </field>
     </fields>
    </register>
    <register>
     <name>CONT_INTEN</name>
     <description>Controller Interrupt Enable Register.</description>
     <addressOffset>0x090</addressOffset>
     <access>read-write</access>
     <fields>
      <field>
       <name>TARG_START</name>
       <description>Target Start Detected.</description>
       <bitRange>[8:8]</bitRange>
      </field>
      <field>
       <name>REQ_DONE</name>
       <description>CTRL request completed.</description>
       <bitRange>[9:9]</bitRange>
      </field>
      <field>
       <name>DONE</name>
       <description>Message complete.</description>
       <bitRange>[10:10]</bitRange>
      </field>
      <field>
       <name>RX_RDY</name>
       <description>Receive data ready.</description>
       <bitRange>[11:11]</bitRange>
      </field>
      <field>
       <name>TX_NFULL</name>
       <description>Ready for transmit data,</description>
       <bitRange>[12:12]</bitRange>
      </field>
      <field>
       <name>IBI_WON</name>
       <description>IBI arbitration won.</description>
       <bitRange>[13:13]</bitRange>
      </field>
      <field>
       <name>ERRWARN</name>
       <description>Error or warning interrupt.</description>
       <bitRange>[15:15]</bitRange>
      </field>
      <field>
       <name>NOW_CONT</name>
       <description>The IP transitioned from I3C bus target to I3C bus controller.</description>
       <bitRange>[19:19]</bitRange>
      </field>
     </fields>
    </register>
    <register>
     <name>CONT_INTCLR</name>
     <description>Controller Interrupt Clear Register.</description>
     <addressOffset>0x094</addressOffset>
     <access>write-only</access>
     <fields>
      <field>
       <name>TARG_START</name>
       <description>Target Start Detected.</description>
       <bitRange>[8:8]</bitRange>
      </field>
      <field>
       <name>REQ_DONE</name>
       <description>CTRL request completed.</description>
       <bitRange>[9:9]</bitRange>
      </field>
      <field>
       <name>DONE</name>
       <description>Message complete.</description>
       <bitRange>[10:10]</bitRange>
      </field>
      <field>
       <name>RX_RDY</name>
       <description>Receive data ready.</description>
       <bitRange>[11:11]</bitRange>
      </field>
      <field>
       <name>TX_NFULL</name>
       <description>Ready for transmit data,</description>
       <bitRange>[12:12]</bitRange>
      </field>
      <field>
       <name>IBI_WON</name>
       <description>IBI arbitration won.</description>
       <bitRange>[13:13]</bitRange>
      </field>
      <field>
       <name>ERRWARN</name>
       <description>Error or warning interrupt.</description>
       <bitRange>[15:15]</bitRange>
      </field>
      <field>
       <name>NOW_CONT</name>
       <description>The IP transitioned from I3C bus target to I3C bus controller.</description>
       <bitRange>[19:19]</bitRange>
      </field>
     </fields>
    </register>
    <register>
     <name>CONT_INTFL</name>
     <description>Controller Interrupt Flag Register.</description>
     <addressOffset>0x098</addressOffset>
     <access>read-only</access>
     <fields>
      <field>
       <name>TARG_START</name>
       <description>Target Start Detected.</description>
       <bitRange>[8:8]</bitRange>
      </field>
      <field>
       <name>REQ_DONE</name>
       <description>CTRL request completed.</description>
       <bitRange>[9:9]</bitRange>
      </field>
      <field>
       <name>DONE</name>
       <description>Message complete.</description>
       <bitRange>[10:10]</bitRange>
      </field>
      <field>
       <name>RX_RDY</name>
       <description>Receive data ready.</description>
       <bitRange>[11:11]</bitRange>
      </field>
      <field>
       <name>TX_NFULL</name>
       <description>Ready for transmit data,</description>
       <bitRange>[12:12]</bitRange>
      </field>
      <field>
       <name>IBI_WON</name>
       <description>IBI arbitration won.</description>
       <bitRange>[13:13]</bitRange>
      </field>
      <field>
       <name>ERRWARN</name>
       <description>Error or warning interrupt.</description>
       <bitRange>[15:15]</bitRange>
      </field>
      <field>
       <name>NOW_CONT</name>
       <description>The IP transitioned from I3C bus target to I3C bus controller.</description>
       <bitRange>[19:19]</bitRange>
      </field>
     </fields>
    </register>
    <register>
     <name>CONT_ERRWARN</name>
     <description>Controller Error and Warning Register.</description>
     <addressOffset>0x09C</addressOffset>
     <access>read-write</access>
     <fields>
      <field>
       <name>NACK</name>
       <description>I3C or I2C mode address emitted by the IP was NACKed by the targets.</description>
       <bitRange>[2:2]</bitRange>
      </field>
      <field>
       <name>TX_ABT</name>
       <description>Write aborted due to data NACK.</description>
       <bitRange>[3:3]</bitRange>
      </field>
      <field>
       <name>RX_TERM</name>
       <description>Controller terminated read in messaage mode.</description>
       <bitRange>[4:4]</bitRange>
      </field>
      <field>
       <name>HDR_PAR</name>
       <description>HDR Parity Error.</description>
       <bitRange>[9:9]</bitRange>
      </field>
      <field>
       <name>HDR_CRC</name>
       <description>HDR-DDR CRC Error.</description>
       <bitRange>[10:10]</bitRange>
      </field>
      <field>
       <name>RX_UNR</name>
       <description>Read data underrun.</description>
       <bitRange>[16:16]</bitRange>
      </field>
      <field>
       <name>TX_OVR</name>
       <description>Write data overrun.</description>
       <bitRange>[17:17]</bitRange>
      </field>
      <field>
       <name>MSG</name>
       <description>Message mode error.</description>
       <bitRange>[18:18]</bitRange>
      </field>
      <field>
       <name>INV_REQ</name>
       <description>Invalid use of request from CTRL register.</description>
       <bitRange>[19:19]</bitRange>
      </field>
      <field>
       <name>TO</name>
       <description>Timeout error.</description>
       <bitRange>[20:20]</bitRange>
      </field>
     </fields>
    </register>
    <register>
     <name>CONT_DMACTRL</name>
     <description>Controller DMA Control Register.</description>
     <addressOffset>0x0A0</addressOffset>
     <access>read-write</access>
     <fields>
      <field>
       <name>RX_EN</name>
       <description>DMA read enable.</description>
       <bitRange>[1:0]</bitRange>
       <enumeratedValues>
        <enumeratedValue>
         <name>DIS</name>
         <description>Disable DMA.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>ONE_FR</name>
         <description>Enable DMA for one frame.</description>
         <value>1</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>EN</name>
         <description>Enable DMA until disabled by setting this field to 0b00.</description>
         <value>2</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>TX_EN</name>
       <description>DMA write enable.</description>
       <bitRange>[3:2]</bitRange>
       <enumeratedValues>
        <enumeratedValue>
         <name>DIS</name>
         <description>Disable DMA.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>ONE_FR</name>
         <description>Enable DMA for one frame.</description>
         <value>1</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>EN</name>
         <description>Enable DMA until disabled by setting this field to 0b00.</description>
         <value>2</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>WIDTH</name>
       <description>Selects the data width for DMA transfers.</description>
       <bitRange>[5:4]</bitRange>
       <enumeratedValues>
        <enumeratedValue>
         <name>BYTE</name>
         <description>Byte size.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>HALFWORD</name>
         <description>Halfword size.</description>
         <value>2</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
     </fields>
    </register>
