analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32657/Include/max32657.svd
    <register>
     <name>CONT_FIFOCTRL</name>
     <description>Controller FIFO Control Register.</description>
     <addressOffset>0x0AC</addressOffset>
     <fields>
      <field>
       <name>TX_FLUSH</name>
       <description>Flush TX FIFO.</description>
       <bitRange>[0:0]</bitRange>
       <access>write-only</access>
      </field>
      <field>
       <name>RX_FLUSH</name>
       <description>Flush RX FIFO.</description>
       <bitRange>[1:1]</bitRange>
       <access>write-only</access>
      </field>
      <field>
       <name>UNLOCK</name>
       <description>Unlock FIFO Triggers.</description>
       <bitRange>[3:3]</bitRange>
       <access>write-only</access>
      </field>
      <field>
       <name>TX_THD_LVL</name>
       <description>TX FIFO trigger level.</description>
       <bitRange>[5:4]</bitRange>
       <access>read-write</access>
       <enumeratedValues>
        <enumeratedValue>
         <name>EMPTY</name>
         <description>Trigger when empty.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>QUARTER_FULL</name>
         <description>Trigger when quarter full or less.</description>
         <value>1</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>HALF_FULL</name>
         <description>Trigger when half full or less.</description>
         <value>2</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>ALMOST_FULL</name>
         <description>Trigger when almost full or less.</description>
         <value>3</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>RX_THD_LVL</name>
       <description>RX FIFO trigger level.</description>
       <bitRange>[7:6]</bitRange>
       <access>read-write</access>
       <enumeratedValues>
        <enumeratedValue>
         <name>NOT_EMPTY</name>
         <description>Trigger when empty.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>QUARTER_FULL</name>
         <description>Trigger when quarter full or less.</description>
         <value>1</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>HALF_FULL</name>
         <description>Trigger when half full or less.</description>
         <value>2</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>3_QUARTER_FULL</name>
         <description>Trigger when 3 quarters full or less.</description>
         <value>3</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>TX_LVL</name>
       <description>Number of messages in TX FIFO.</description>
       <bitRange>[21:16]</bitRange>
       <access>read-only</access>
      </field>
      <field>
       <name>RX_LVL</name>
       <description>Number of messages in RX FIFO.</description>
       <bitRange>[29:24]</bitRange>
       <access>read-only</access>
      </field>
      <field>
       <name>TX_FULL</name>
       <description>TX FIFO Full flag.</description>
       <bitRange>[30:30]</bitRange>
       <access>read-only</access>
      </field>
      <field>
       <name>RX_EM</name>
       <description>RX FIFO Empty Flag.</description>
       <bitRange>[31:31]</bitRange>
       <access>read-only</access>
      </field>
     </fields>
    </register>
    <register>
     <name>CONT_TXFIFO8</name>
     <description>Controller Write Byte Data Register.</description>
     <addressOffset>0x0B0</addressOffset>
     <access>write-only</access>
     <fields>
      <field>
       <name>DATA</name>
       <description>Data byte to send.</description>
       <bitRange>[7:0]</bitRange>
      </field>
      <field>
       <name>END</name>
       <description>End of data.</description>
       <bitRange>[8:8]</bitRange>
      </field>
      <field>
       <name>END2</name>
       <description>End of data.</description>
       <bitRange>[16:16]</bitRange>
      </field>
     </fields>
    </register>
    <register>
     <name>CONT_TXFIFO8E</name>
     <description>Controller Write Byte Data as End Register.</description>
     <addressOffset>0x0B4</addressOffset>
     <access>write-only</access>
     <fields>
      <field>
       <name>DATA</name>
       <description>Data is read from or written to this location. Transmit and receive FIFO are separate but both are addressed at this location.</description>
       <bitRange>[7:0]</bitRange>
      </field>
     </fields>
    </register>
    <register>
     <name>CONT_TXFIFO16</name>
     <description>Controller Write Half-Word Data Register.</description>
     <addressOffset>0x0B8</addressOffset>
     <access>write-only</access>
     <fields>
      <field>
       <name>DATA</name>
       <description>Data halfword to send.</description>
       <bitRange>[15:0]</bitRange>
      </field>
      <field>
       <name>END</name>
       <description>End of data.</description>
       <bitRange>[16:16]</bitRange>
      </field>
     </fields>
    </register>
    <register>
     <name>CONT_TXFIFO16E</name>
     <description>Controller Write Half-Word Data as End Register.</description>
     <addressOffset>0x0BC</addressOffset>
     <access>write-only</access>
     <fields>
      <field>
       <name>DATA</name>
       <description>Data halfword to send.</description>
       <bitRange>[15:0]</bitRange>
      </field>
     </fields>
    </register>
    <register>
     <name>CONT_RXFIFO8</name>
     <description>Controller Read Byte Data Register.</description>
     <addressOffset>0x0C0</addressOffset>
     <access>read-only</access>
     <fields>
      <field>
       <name>DATA</name>
       <description>Read data byte from RX FIFO.</description>
       <bitRange>[7:0]</bitRange>
      </field>
     </fields>
    </register>
    <register>
     <name>CONT_RXFIFO16</name>
     <description>Controller Read Half-Word Data Register.</description>
     <addressOffset>0x0C8</addressOffset>
     <access>read-only</access>
     <fields>
      <field>
       <name>DATA</name>
       <description>Read data hyalfword from RX FIFO.</description>
       <bitRange>[15:0]</bitRange>
      </field>
     </fields>
    </register>
    <register>
     <name>CONT_TXFIFO8O</name>
     <description>Controller Byte-Only Write Byte Data Register.</description>
     <addressOffset>0x0CC</addressOffset>
     <access>write-only</access>
     <fields>
      <field>
       <name>DATA</name>
       <description>Data byte to send.</description>
       <bitRange>[7:0]</bitRange>
      </field>
     </fields>
    </register>
    <register>
     <name>CONT_TXSDRMSG_CTRL</name>
     <description>Controller Start or Continue SDR Message Register.</description>
     <addressOffset>0x0D0</addressOffset>
     <access>read-write</access>
     <fields>
      <field>
       <name>RDWR_DIR</name>
       <description>Direction of the transfer.</description>
       <bitRange>[0:0]</bitRange>
      </field>
      <field>
       <name>ADDR</name>
       <description>Destination address of message.</description>
       <bitRange>[7:1]</bitRange>
      </field>
      <field>
       <name>END</name>
       <description>Select how to end message.</description>
       <bitRange>[8:8]</bitRange>
      </field>
      <field>
       <name>I2C_EN</name>
       <description>I2C Mode Enable.</description>
       <bitRange>[10:10]</bitRange>
      </field>
      <field>
       <name>LEN</name>
       <description>Message length in bytes.</description>
       <bitRange>[15:11]</bitRange>
      </field>
     </fields>
    </register>
    <register>
     <name>CONT_TXSDRMSG_FIFO</name>
     <description>Controller Start or Continue SDR Message Register.</description>
     <addressOffset>0x0D0</addressOffset>
     <access>write-only</access>
     <fields>
      <field>
       <name>DATA</name>
       <description>Data for SDR write message after control information has been written.</description>
       <bitRange>[15:0]</bitRange>
      </field>
     </fields>
    </register>
    <register>
     <name>CONT_RXSDRMSG</name>
     <description>Controller Read SDR Message Data Register.</description>
     <addressOffset>0x0D4</addressOffset>
     <access>read-only</access>
     <fields>
      <field>
       <name>DATA</name>
       <description>Data for SDR write message after control information has been written.</description>
       <bitRange>[15:0]</bitRange>
      </field>
     </fields>
    </register>
    <register>
     <name>CONT_TXDDRMSG</name>
     <description>Controller Start or Continue DDR Message Register.</description>
     <addressOffset>0x0D8</addressOffset>
     <access>write-only</access>
     <fields>
      <field>
       <name>MSG</name>
       <description>Data, address/command, and control information.</description>
       <bitRange>[15:0]</bitRange>
      </field>
     </fields>
    </register>
    <register>
     <name>CONT_RXDDR16</name>
     <description>Controller Read DDR Message Data Register.</description>
     <addressOffset>0x0DC</addressOffset>
     <access>read-only</access>
     <fields>
      <field>
       <name>DATA</name>
       <description>Read data (16bits).</description>
       <bitRange>[15:0]</bitRange>
      </field>
     </fields>
    </register>
    <register>
     <name>CONT_DYNADDR</name>
     <description>Controller Dynamic Address Register.</description>
     <addressOffset>0x0E4</addressOffset>
     <access>read-write</access>
     <fields>
      <field>
       <name>ADDR</name>
       <description>The assigned dynamic address.</description>
       <bitRange>[7:1]</bitRange>
      </field>
      <field>
       <name>VALID</name>
       <description>Address valid check.</description>
       <bitRange>[8:8]</bitRange>
      </field>
     </fields>
    </register>
    <register>
     <name>TARG_GROUPDEF</name>
     <description>Target Group Definition Register.</description>
     <addressOffset>0x114</addressOffset>
     <access>read-only</access>
     <fields>
      <field>
       <name>ADDR_EN</name>
       <description>Group Address enable.</description>
       <bitRange>[0:0]</bitRange>
      </field>
      <field>
       <name>ADDR</name>
       <description>Group Address .</description>
       <bitRange>[7:1]</bitRange>
      </field>
     </fields>
    </register>
    <register>
     <name>TARG_MAPCTRL0</name>
     <description>Target Primary Map Control Register.</description>
     <addressOffset>0x11C</addressOffset>
     <access>read-write</access>
     <fields>
      <field>
       <name>DYNADDR_EN</name>
       <description>Dynamic address is enabled.</description>
       <bitRange>[0:0]</bitRange>
      </field>
      <field>
       <name>DYNADDR</name>
       <description>Dynamic address.</description>
       <bitRange>[7:1]</bitRange>
      </field>
      <field>
       <name>CAUSE</name>
       <description>Indicates how the last primary dynamic address value change occurred.</description>
       <bitRange>[10:8]</bitRange>
      </field>
     </fields>
    </register>
    <register>
     <name>TARG_MAPCTRL1</name>
     <description>Target Map Control 1 Register.</description>
     <addressOffset>0x120</addressOffset>
     <access>read-write</access>
     <fields>
      <field>
       <name>EN</name>
       <description>Mapped address slot is enabled.</description>
       <bitRange>[0:0]</bitRange>
      </field>
      <field>
       <name>ADDR</name>
       <description>Static or Dynamic address.</description>
       <bitRange>[7:1]</bitRange>
      </field>
      <field>
       <name>STATADDR_EN</name>
       <description>ADDR field contains the I2C static address if enabled.</description>
       <bitRange>[8:8]</bitRange>
      </field>
      <field>
       <name>STATADDR_10B</name>
       <description>Contains the upper 3 bits of a 10-bit I2C Static Address.</description>
       <bitRange>[11:9]</bitRange>
      </field>
      <field>
       <name>NACK</name>
       <description>Indicates how the last primary dynamic address value change occurred.</description>
       <bitRange>[12:12]</bitRange>
      </field>
     </fields>
    </register>
    <register>
     <name>TARG_MAPCTRL2</name>
     <description>Target Map Control 2 Register.</description>
     <addressOffset>0x124</addressOffset>
     <access>read-write</access>
     <fields>
      <field>
       <name>EN</name>
       <description>Mapped address slot is enabled.</description>
       <bitRange>[0:0]</bitRange>
      </field>
      <field>
       <name>ADDR</name>
       <description>Static or Dynamic address.</description>
       <bitRange>[7:1]</bitRange>
      </field>
      <field>
       <name>STATADDR_EN</name>
       <description>ADDR field contains the I2C static address if enabled.</description>
       <bitRange>[8:8]</bitRange>
      </field>
      <field>
       <name>NACK</name>
       <description>Indicates how the last primary dynamic address value change occurred.</description>
       <bitRange>[12:12]</bitRange>
      </field>
      <field>
       <name>AUTO_EN</name>
       <description>Enable slot for automatic dynamic address assignment.</description>
       <bitRange>[13:13]</bitRange>
      </field>
      <field>
       <name>PID</name>
       <description>Indicates how the last primary dynamic address value change occurred.</description>
       <bitRange>[31:14]</bitRange>
      </field>
     </fields>
    </register>
