analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32657/Include/max32657.svd
   </registers>
  </peripheral>

  <peripheral derivedFrom="MPC">
   <name>MPC1</name>
   <description>Memory Protection Controller. 1</description>
   <baseAddress>0x50092000</baseAddress>
  </peripheral>

  <peripheral derivedFrom="MPC">
   <name>MPC2</name>
   <description>Memory Protection Controller. 2</description>
   <baseAddress>0x50093000</baseAddress>
  </peripheral>

  <peripheral derivedFrom="MPC">
   <name>MPC3</name>
   <description>Memory Protection Controller. 3</description>
   <baseAddress>0x50094000</baseAddress>
  </peripheral>

  <peripheral derivedFrom="MPC">
   <name>MPC4</name>
   <description>Memory Protection Controller. 4</description>
   <baseAddress>0x50095000</baseAddress>
  </peripheral>

  <peripheral derivedFrom="MPC">
   <name>MPC5</name>
   <description>Memory Protection Controller. 5</description>
   <baseAddress>0x50096000</baseAddress>
  </peripheral>

  <peripheral>
   <name>NSPC</name>
   <description>Non-Secure Privilege Controller.</description>
   <baseAddress>0x40090000</baseAddress>
   <addressBlock>
    <offset>0x00</offset>
    <size>0x1000</size>
    <usage>registers</usage>
   </addressBlock>
   <registers>
    <register>
     <name>APBPRIV</name>
     <description>APB Tartet Privileged/Non-privileged PPC Access Register.</description>
     <addressOffset>0x0160</addressOffset>
     <fields>
      <field>
       <name>PERIPH</name>
       <description>Each bit configures the APB PPC to enforce the security access allowed for an individual peripheral.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>32</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>GCR</name>
         <description>Privilege setting for GCR.</description>
         <value>0x01</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>SIR</name>
         <description>Privilege setting for SIR.</description>
         <value>0x02</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>FCR</name>
         <description>Privilege setting for FCR.</description>
         <value>0x04</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>WDT</name>
         <description>Privilege setting for WDT.</description>
         <value>0x08</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>AES</name>
         <description>Privilege setting for AES.</description>
         <value>0x010</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>AESKEYS</name>
         <description>Privilege setting for AESKEYS.</description>
         <value>0x020</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>CRC</name>
         <description>Privilege setting for CRC.</description>
         <value>0x040</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>GPIO0</name>
         <description>Privilege setting for GPIO0.</description>
         <value>0x080</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>TMR0</name>
         <description>Privilege setting for TMR0.</description>
         <value>0x0100</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>TMR1</name>
         <description>Privilege setting for TMR1.</description>
         <value>0x0200</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>TMR2</name>
         <description>Privilege setting for TMR2.</description>
         <value>0x0400</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>TMR3</name>
         <description>Privilege setting for TMR3.</description>
         <value>0x0800</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>TMR4</name>
         <description>Privilege setting for TMR4.</description>
         <value>0x01000</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>TMR5</name>
         <description>Privilege setting for TMR5.</description>
         <value>0x02000</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>I3C</name>
         <description>Privilege setting for I3C.</description>
         <value>0x04000</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>UART</name>
         <description>Privilege setting for UART.</description>
         <value>0x08000</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>SPI</name>
         <description>Privilege setting for SPI.</description>
         <value>0x010000</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>TRNG</name>
         <description>Privilege setting for TRNG.</description>
         <value>0x020000</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>BTLE_DBB</name>
         <description>Privilege setting for BTLE DBB.</description>
         <value>0x040000</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>BTLE_RFFE</name>
         <description>Privilege setting for BTLE RFFE.</description>
         <value>0x080000</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>RSTZ</name>
         <description>Privilege setting for RSTZ.</description>
         <value>0x0100000</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>BOOST</name>
         <description>Privilege setting for Boost Controller.</description>
         <value>0x0200000</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>TRIMSIR</name>
         <description>Privilege setting for TRIMSIR.</description>
         <value>0x0400000</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>RTC</name>
         <description>Privilege setting for RTC.</description>
         <value>0x01000000</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>WUT0</name>
         <description>Privilege setting for WUT0.</description>
         <value>0x02000000</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>WUT1</name>
         <description>Privilege setting for WUT1.</description>
         <value>0x04000000</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>PWRSEQ</name>
         <description>Privilege setting for Power Sequencer.</description>
         <value>0x08000000</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>MCR</name>
         <description>Privilege setting for MCR.</description>
         <value>0x10000000</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>ALL</name>
         <description>Privilege setting for all peripherals.</description>
         <value>0x1F7FFFFF</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
     </fields>
    </register>
    <register>
     <name>AHBMPRIV</name>
     <description>AHB Privileged/Non-Privileged Non-Secure DMA Access Register.</description>
     <addressOffset>0x0170</addressOffset>
     <fields>
      <field>
       <name>DMA</name>
       <description>Control access for transactions coming from the Non-Secure DMA.</description>
       <bitOffset>1</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
     </fields>
    </register>
