analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32657/Include/max32657.svd
   </registers>
  </peripheral>

  <peripheral>
   <name>RSTZ</name>
   <description>RSTZ Controller</description>
   <baseAddress>0x50004800</baseAddress>
   <addressBlock>
    <offset>0x00</offset>
    <size>0x400</size>
    <usage>registers</usage>
   </addressBlock>
   <registers>
    <register>
     <name>CTRL</name>
     <description>RSTZ Control Register.</description>
     <addressOffset>0x000</addressOffset>
     <size>32</size>
     <fields>
      <field>
       <name>EN</name>
       <description>Enable channels.</description>
       <bitRange>[0:0]</bitRange>
       <access>read-write</access>
      </field>
      <field>
       <name>SVC_EN</name>
       <description>Enable the SVC.</description>
       <bitRange>[1:1]</bitRange>
       <access>read-write</access>
      </field>
      <field>
       <name>CH_SEL</name>
       <description>Channel Select.</description>
       <bitRange>[4:2]</bitRange>
       <access>read-write</access>
      </field>
      <field>
       <name>CAL_EN</name>
       <description>Calibration mode enable.</description>
       <bitRange>[5:5]</bitRange>
       <access>read-write</access>
      </field>
      <field>
       <name>DMEASURE_EN</name>
       <description>Direct Measure mode enable.</description>
       <bitRange>[6:6]</bitRange>
       <access>read-write</access>
      </field>
      <field>
       <name>OFFTR_P</name>
       <description>Offset Trim for positive comparator.</description>
       <bitRange>[11:7]</bitRange>
       <access>read-write</access>
      </field>
      <field>
       <name>OFFTR_N</name>
       <description>Offset Trim for negative comparator.</description>
       <bitRange>[16:12]</bitRange>
       <access>read-write</access>
      </field>
      <field>
       <name>DOUT</name>
       <description>Comparator Result.</description>
       <bitRange>[17:17]</bitRange>
       <access>read-write</access>
      </field>
      <field>
       <name>CAL_DOUT_POL</name>
       <description>Calibration DOUT Polarity.</description>
       <bitRange>[18:18]</bitRange>
       <access>read-write</access>
      </field>
      <field>
       <name>NUM_SAMP</name>
       <description>Number of captures per sample.</description>
       <bitRange>[27:24]</bitRange>
       <access>read-write</access>
      </field>
      <field>
       <name>TRIP_TOL</name>
       <description>Number of failed DOUT captures (tolerance) before corresponding RSTZ signal is tripped.</description>
       <bitRange>[31:28]</bitRange>
       <access>read-write</access>
      </field>
     </fields>
    </register>
    <register>
     <name>BOOST_CLKCTRL</name>
     <description>Boost Clock Control Register.</description>
     <addressOffset>0x004</addressOffset>
     <fields>
      <field>
       <name>EXIT_NUM_SAMP</name>
       <description>Defines how many samples needed of boost output channel to perform when exiting low-power mode before returning to normal active operation.</description>
       <bitRange>[1:0]</bitRange>
       <access>read-write</access>
      </field>
      <field>
       <name>CH_SEL</name>
       <description>Select when channel the output of the boost converter is monitored on.</description>
       <bitRange>[4:2]</bitRange>
       <access>read-write</access>
      </field>
     </fields>
    </register>
    <register>
     <dim>8</dim>
     <dimIncrement>4</dimIncrement>
     <name>STATUS_CH[%s]</name>
     <description>Channel X Status Register.</description>
     <addressOffset>0x028</addressOffset>
     <size>32</size>
     <access>read-write</access>
     <fields>
      <field>
       <name>RSTZ</name>
       <description>Result of most recent sample result.</description>
       <bitRange>[0:0]</bitRange>
       <access>read-only</access>
      </field>
      <field>
       <name>DOUT</name>
       <description>Store the most recent DOUT capture for a given channel.</description>
       <bitRange>[1:1]</bitRange>
       <access>read-only</access>
      </field>
      <field>
       <name>RSTZ_FL</name>
       <description>RSTZ Flag indicates the RSTZ was tripped at some point since the last time being cleared.</description>
       <bitRange>[31:31]</bitRange>
       <access>read-write</access>
      </field>
     </fields>
    </register>
   </registers>
  </peripheral>

  <peripheral>
   <name>RTC</name>
   <description>Real Time Clock and Alarm.</description>
   <baseAddress>0x50006000</baseAddress>
   <addressBlock>
    <offset>0x00</offset>
    <size>0x400</size>
    <usage>registers</usage>
   </addressBlock>
   <interrupt>
    <name>RTC</name>
    <description>RTC interrupt.</description>
    <value>3</value>
   </interrupt>
   <registers>
    <register>
     <name>SEC</name>
     <description>RTC Second Counter. This register contains the 32-bit second counter.</description>
     <addressOffset>0x00</addressOffset>
     <resetMask>0x00000000</resetMask>
     <fields>
      <field>
       <name>SEC</name>
       <description>Seconds Counter.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>32</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>SSEC</name>
     <description>RTC Sub-second Counter. This counter increments at 256Hz. RTC_SEC is incremented when this register rolls over from 0xFF to 0x00.</description>
     <addressOffset>0x04</addressOffset>
     <resetMask>0x00000000</resetMask>
     <fields>
      <field>
       <name>SSEC</name>
       <description>Sub-Seconds Counter (12-bit).</description>
       <bitOffset>0</bitOffset>
       <bitWidth>12</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>TODA</name>
     <description>Time-of-day Alarm.</description>
     <addressOffset>0x08</addressOffset>
     <resetMask>0x00000000</resetMask>
     <fields>
      <field>
       <name>TOD_ALARM</name>
       <description>Time-of-day Alarm.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>20</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>SSECA</name>
     <description>RTC sub-second alarm.  This register contains the reload value for the sub-second alarm.</description>
     <addressOffset>0x0C</addressOffset>
     <resetMask>0x00000000</resetMask>
     <fields>
      <field>
       <name>SSEC_ALARM</name>
       <description>This register contains the reload value for the sub-second alarm.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>32</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>CTRL</name>
     <description>RTC Control Register.</description>
     <addressOffset>0x10</addressOffset>
     <resetValue>0x00000008</resetValue>
     <resetMask>0xFFFFFF38</resetMask>
     <fields>
      <field>
       <name>EN</name>
       <description>Real Time Clock Enable. This bit enables the Real Time Clock. This bit can only be written when WE=1 and BUSY =0. Change to this bit is effective only after BUSY is cleared from 1 to 0.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>dis</name>
         <description>Disable.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>en</name>
         <description>Enable.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>TOD_ALARM_IE</name>
       <description>Alarm Time-of-Day Interrupt Enable. Change to this bit is effective only after BUSY is cleared from 1 to 0.</description>
       <bitOffset>1</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>dis</name>
         <description>Disable.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>en</name>
         <description>Enable.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>SSEC_ALARM_IE</name>
       <description>Alarm Sub-second Interrupt Enable.  Change to this bit is effective only after BUSY is cleared from 1 to 0.</description>
       <bitOffset>2</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>dis</name>
         <description>Disable.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>en</name>
         <description>Enable.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>BUSY</name>
       <description>RTC Busy. This bit is set to 1 by hardware when changes to RTC registers required a synchronized version of the register to be in place.  This bit is automatically cleared by hardware.</description>
       <bitOffset>3</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-only</access>
       <enumeratedValues>
        <enumeratedValue>
         <name>idle</name>
         <description>Idle.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>busy</name>
         <description>Busy.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>RDY</name>
       <description>RTC Ready. This bit is set to 1 by hardware when the RTC count registers update.  It can be cleared to 0 by software at any time. It will also be cleared to 0 by hardware just prior to an update of the RTC count register.</description>
       <bitOffset>4</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>busy</name>
         <description>Register has not updated.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>ready</name>
         <description>Ready.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>RDY_IE</name>
       <description>RTC Ready Interrupt Enable.</description>
       <bitOffset>5</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>dis</name>
         <description>Disable.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>en</name>
         <description>Enable.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>TOD_ALARM_IF</name>
       <description>Time-of-Day Alarm Interrupt Flag.  This alarm is qualified as wake-up source to the processor.</description>
       <bitOffset>6</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-only</access>
       <enumeratedValues>
        <enumeratedValue>
         <name>inactive</name>
         <description>Not active.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>pending</name>
         <description>Active.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>SSEC_ALARM_IF</name>
       <description>Sub-second Alarm Interrupt Flag. This alarm is qualified as wake-up source to the processor.</description>
       <bitOffset>7</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-only</access>
       <enumeratedValues>
        <enumeratedValue>
         <name>inactive</name>
         <description>Not active.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>pending</name>
         <description>Active.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>SQW_EN</name>
       <description>Square Wave Output Enable.</description>
       <bitOffset>8</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>dis</name>
         <description>Disable.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>en</name>
         <description>Enable.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>SQW_SEL</name>
       <description>Frequency Output Selection. When SQE=1, these bits specify the output frequency on the SQW pin.</description>
       <bitOffset>9</bitOffset>
       <bitWidth>2</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>freq1Hz</name>
         <description>1 Hz (Compensated).</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>freq512Hz</name>
         <description>512 Hz (Compensated).</description>
         <value>1</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>freq4KHz</name>
         <description>4 KHz.</description>
         <value>2</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>RD_EN</name>
       <description>Asynchronous Counter Read Enable.</description>
       <bitOffset>14</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>sync</name>
         <description>Synchronous.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>async</name>
         <description>Asynchronous.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>WR_EN</name>
       <description>Write Enable. This register bit serves as a protection mechanism against unintentional writes to critical RTC bits.</description>
       <bitOffset>15</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>ignore</name>
         <description>Ignored.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>allow</name>
         <description>Allowed.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
     </fields>
    </register>
    <register>
     <name>TRIM</name>
     <description>RTC Trim Register.</description>
     <addressOffset>0x14</addressOffset>
     <resetMask>0x00000000</resetMask>
     <fields>
      <field>
       <name>TRIM</name>
       <description>RTC Trim. This register contains the 2's complement value that specifies the trim resolution. Each increment or decrement of the bit adds or subtracts 1ppm at each 4KHz clock value, with a maximum correction of +/- 127ppm.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>8</bitWidth>
      </field>
      <field>
       <name>VBAT_TMR</name>
       <description>VBAT Timer Value. When RTC is running off of VBAT, this field is incremented every 32 seconds.</description>
       <bitOffset>8</bitOffset>
       <bitWidth>24</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>OSCCTRL</name>
     <description>RTC Oscillator Control Register.</description>
     <addressOffset>0x18</addressOffset>
     <resetMask>0x00000000</resetMask>
     <fields>
      <field>
       <name>FILTER_EN</name>
       <description>Enable Filter.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>IBIAS_SEL</name>
       <description>IBIAS Select.</description>
       <bitOffset>1</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>2x</name>
         <description>2x</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>4x</name>
         <description>4x</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>HYST_EN</name>
       <description>RTC Hysteresis Enable.</description>
       <bitOffset>2</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>IBIAS_EN</name>
       <description>RTC IBIAS Enable.</description>
       <bitOffset>3</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>BYPASS</name>
       <description>RTC Crystal Bypass</description>
       <bitOffset>4</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>dis</name>
         <description>Disable.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>en</name>
         <description>Enable.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>SQW_32K</name>
       <description>RTC 32kHz Square Wave Output</description>
       <bitOffset>5</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>dis</name>
         <description>Disable.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>en</name>
         <description>Enable.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
     </fields>
    </register>
