analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32657/Include/max32657.svd
   </registers>
  </peripheral>

  <peripheral>
   <name>SIR</name>
   <description>System Initialization Registers.</description>
   <baseAddress>0x50000400</baseAddress>
   <access>read-only</access>
   <addressBlock>
    <offset>0x00</offset>
    <size>0x400</size>
    <usage>registers</usage>
   </addressBlock>
   <registers>
    <register>
     <name>SISTAT</name>
     <description>System Initialization Status Register.</description>
     <addressOffset>0x000</addressOffset>
     <access>read-only</access>
     <fields>
      <field>
       <name>MAGIC</name>
       <description>Magic Word Validation.  This bit is set by the system initialization block following power-up.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-only</access>
       <enumeratedValues>
        <usage>read</usage>
        <enumeratedValue>
         <name>magicNotSet</name>
         <description>Magic word was not set (OTP has not been initialized properly).</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>magicSet</name>
         <description>Magic word was set (OTP contains valid settings).</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>CRCERR</name>
       <description>CRC Error Status.  This bit is set by the system initialization block following power-up.</description>
       <bitOffset>1</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-only</access>
       <enumeratedValues>
        <usage>read</usage>
        <enumeratedValue>
         <name>noError</name>
         <description>No CRC errors occurred during the read of the OTP memory block.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>error</name>
         <description>A CRC error occurred while reading the OTP. The address of the failure location in the OTP memory is stored in the ERRADDR register.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
     </fields>
    </register>
    <register>
     <name>ADDR</name>
     <description>Read-only field set by the SIB block if a CRC error occurs during the read of the OTP memory. Contains the failing address in OTP memory (when CRCERR equals 1).</description>
     <addressOffset>0x004</addressOffset>
     <access>read-only</access>
     <fields>
      <field>
       <name>ERRADDR</name>
       <bitOffset>0</bitOffset>
       <bitWidth>32</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>BTLELDO_BB</name>
     <description>BTLE LDO TRIM BB Register.</description>
     <addressOffset>0x01C</addressOffset>
     <fields>
      <field>
       <name>TRIM</name>
       <description>Target 0.9V. VDDA BB Voltage Trim.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>5</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>BTLELDO_RF</name>
     <description>BTLE LDO TRIM RF Register.</description>
     <addressOffset>0x002C</addressOffset>
     <fields>
      <field>
       <name>TRIM</name>
       <description>Target 0.9V. VDDA RF Voltage Trim.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>5</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>SFSTAT</name>
     <description>Security function status register.</description>
     <addressOffset>0x104</addressOffset>
     <access>read-only</access>
     <fields>
      <field>
       <name>SECBOOT_EN</name>
       <description>Security Boot.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>SECEXT_EN</name>
       <description>M33 SecExt Function Enable.</description>
       <bitOffset>1</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
     </fields>
    </register>
   </registers>
  </peripheral>

  <peripheral>
   <name>SPC</name>
   <description>Secure Privilege Controller.</description>
   <baseAddress>0x50090000</baseAddress>
   <addressBlock>
    <offset>0x00</offset>
    <size>0x1000</size>
    <usage>registers</usage>
   </addressBlock>
   <registers>
    <register>
     <name>CTRL</name>
     <description>SPC Secure Configuration Control Register.</description>
     <addressOffset>0x0000</addressOffset>
     <size>32</size>
     <fields>
      <field>
       <name>LOCK</name>
       <description>Write 1 to set, disables writes to security-related control registers in the SPC. Once set, the locked registers cannot be modified nor can this bit be cleared to 0 except through a reset.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>RESP</name>
     <description>Security Violation Response Configuration Register.</description>
     <addressOffset>0x0008</addressOffset>
     <size>32</size>
     <fields>
      <field>
       <name>VIOLCFG</name>
       <description>This field configures the target response in case of a secuirty violation.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>MPC_STATUS</name>
     <description>Secure MPC Status Register.</description>
     <addressOffset>0x0020</addressOffset>
     <size>8</size>
     <access>read-only</access>
     <fields>
      <field>
       <name>SRAM0</name>
       <description>Interrupt status for SRAM 0 Memory Protection Controller.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>SRAM1</name>
       <description>Interrupt status for SRAM1 Memory Protection Controllers.</description>
       <bitOffset>1</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>SRAM2</name>
       <description>Interrupt status for SRAM2 Memory Protection Controllers.</description>
       <bitOffset>2</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>SRAM3</name>
       <description>Interrupt status for SRAM3 Memory Protection Controllers.</description>
       <bitOffset>3</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>SRAM4</name>
       <description>Interrupt status for SRAM4 Memory Protection Controllers.</description>
       <bitOffset>4</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>FLASH</name>
       <description>Interrupt status for Flash Memory Protection Controllers.</description>
       <bitOffset>5</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>MPC_INTEN</name>
     <description>Secure MPC Interrupt Enable Register.</description>
     <addressOffset>0x0024</addressOffset>
     <fields>
      <field>
       <name>SRAM0</name>
       <description>Interrupt enable for SRAM 0 Memory Protection Controller.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>SRAM1</name>
       <description>Interrupt enable for SRAM1 Memory Protection Controllers.</description>
       <bitOffset>1</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>SRAM2</name>
       <description>Interrupt enable for SRAM2 Memory Protection Controllers.</description>
       <bitOffset>2</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>SRAM3</name>
       <description>Interrupt enable for SRAM3 Memory Protection Controllers.</description>
       <bitOffset>3</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>SRAM4</name>
       <description>Interrupt enable for SRAM4 Memory Protection Controllers.</description>
       <bitOffset>4</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>FLASH</name>
       <description>Interrupt enable for Flash Memory Protection Controllers.</description>
       <bitOffset>5</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>PPC_STATUS</name>
     <description>Secure PPC Interrupt Status Register.</description>
     <addressOffset>0x0030</addressOffset>
     <access>read-only</access>
     <fields>
      <field>
       <name>APBPPC</name>
       <description>Interrupt Status of APB PPC for targets on APB bus. Each bit ties to an individual PPC in the system.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>4</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>PPC_INTCLR</name>
     <description>Secure PPC Interrupt Clear Register.</description>
     <addressOffset>0x0034</addressOffset>
     <access>write-only</access>
     <fields>
      <field>
       <name>APBPPC</name>
       <description>Interrupt Clear of APB PPC for targets on the APB bus. Each bit ties to an individual PPC in the system.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>4</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>PPC_INTEN</name>
     <description>Secure PPC Interrupt Enable Register.</description>
     <addressOffset>0x0038</addressOffset>
     <fields>
      <field>
       <name>APBPPC</name>
       <description>Interrupt Enable for APB PPC for targets on the APB bus. Each bit ties to an individual PPC in the system.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>4</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>NSCIDAU</name>
     <description>Non-Secure Callabale IDAU Configuration Register.</description>
     <addressOffset>0x0080</addressOffset>
     <fields>
      <field>
       <name>CODE</name>
       <description>Configures whether the CODE region is Non-secure Callable.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>SRAM</name>
       <description>Configures whether the RAM region is Non-secure Callable.</description>
       <bitOffset>1</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>M33LOCK</name>
     <description>M33 Core Register Lock Configuratrion Register.</description>
     <addressOffset>0x0090</addressOffset>
     <fields>
      <field>
       <name>AIRCR_VTOR_S</name>
       <description>Lock VTOR_S, AIRCR.PRIS, and AIRCR.BFHFNMINS.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>VTOR_NS</name>
       <description>Lock VTOR_NS register.</description>
       <bitOffset>1</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>MPU_S</name>
       <description>Lock secure MPU registers.</description>
       <bitOffset>2</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>MPU_NS</name>
       <description>Lock non-secure MPU registers.</description>
       <bitOffset>3</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>SAU</name>
       <description>Lock Security Attribution Unit (SAU).</description>
       <bitOffset>4</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>APBSEC</name>
     <description>APB Target Secure/Non-secure PPC Access Register.</description>
     <addressOffset>0x0120</addressOffset>
     <fields>
      <field>
       <name>PERIPH</name>
       <description>Each bit configures the APB PPC to enforce the security access allowed for an individual peripheral.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>32</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>GCR</name>
         <description>Security Access for GCR.</description>
         <value>0x01</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>SIR</name>
         <description>Security Access for SIR.</description>
         <value>0x02</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>FCR</name>
         <description>Security Access for FCR.</description>
         <value>0x04</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>WDT</name>
         <description>Security Access for WDT.</description>
         <value>0x08</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>AES</name>
         <description>Security Access for AES.</description>
         <value>0x010</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>AESKEYS</name>
         <description>Security Access for AESKEYS.</description>
         <value>0x020</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>CRC</name>
         <description>Security Access for CRC.</description>
         <value>0x040</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>GPIO0</name>
         <description>Security Access for GPIO0.</description>
         <value>0x080</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>TMR0</name>
         <description>Security Access for TMR0.</description>
         <value>0x0100</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>TMR1</name>
         <description>Security Access for TMR1.</description>
         <value>0x0200</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>TMR2</name>
         <description>Security Access for TMR2.</description>
         <value>0x0400</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>TMR3</name>
         <description>Security Access for TMR3.</description>
         <value>0x0800</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>TMR4</name>
         <description>Security Access for TMR4.</description>
         <value>0x01000</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>TMR5</name>
         <description>Security Access for TMR5.</description>
         <value>0x02000</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>I3C</name>
         <description>Security Access for I3C.</description>
         <value>0x04000</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>UART</name>
         <description>Security Access for UART.</description>
         <value>0x08000</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>SPI</name>
         <description>Security Access for SPI.</description>
         <value>0x010000</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>TRNG</name>
         <description>Security Access for TRNG.</description>
         <value>0x020000</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>BTLE_DBB</name>
         <description>Security Access for BTLE DBB.</description>
         <value>0x040000</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>BTLE_RFFE</name>
         <description>Security Access for BTLE RFFE.</description>
         <value>0x080000</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>RSTZ</name>
         <description>Security Access for RSTZ.</description>
         <value>0x0100000</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>BOOST</name>
         <description>Security Access for Boost Controller.</description>
         <value>0x0200000</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>TRIMSIR</name>
         <description>Security Access for TRIMSIR.</description>
         <value>0x0400000</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>RTC</name>
         <description>Security Access for RTC.</description>
         <value>0x01000000</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>WUT0</name>
         <description>Security Access for WUT0.</description>
         <value>0x02000000</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>WUT1</name>
         <description>Security Access for WUT1.</description>
         <value>0x04000000</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>PWRSEQ</name>
         <description>Security Access for Power Sequencer.</description>
         <value>0x08000000</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>MCR</name>
         <description>Security Access for MCR.</description>
         <value>0x10000000</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>ALL</name>
         <description>Security Access for all peripherals.</description>
         <value>0x1F7FFFFF</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
     </fields>
    </register>
    <register>
     <name>APBPRIV</name>
     <description>APB Tartet Privileged/Non-privileged PPC Access Register.</description>
     <addressOffset>0x0160</addressOffset>
     <fields>
      <field>
       <name>PERIPH</name>
       <description>Each bit configures the APB PPC to enforce the security access allowed for an individual peripheral.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>32</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>GCR</name>
         <description>Privilege setting for GCR.</description>
         <value>0x01</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>SIR</name>
         <description>Privilege setting for SIR.</description>
         <value>0x02</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>FCR</name>
         <description>Privilege setting for FCR.</description>
         <value>0x04</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>WDT</name>
         <description>Privilege setting for WDT.</description>
         <value>0x08</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>AES</name>
         <description>Privilege setting for AES.</description>
         <value>0x010</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>AESKEYS</name>
         <description>Privilege setting for AESKEYS.</description>
         <value>0x020</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>CRC</name>
         <description>Privilege setting for CRC.</description>
         <value>0x040</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>GPIO0</name>
         <description>Privilege setting for GPIO0.</description>
         <value>0x080</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>TMR0</name>
         <description>Privilege setting for TMR0.</description>
         <value>0x0100</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>TMR1</name>
         <description>Privilege setting for TMR1.</description>
         <value>0x0200</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>TMR2</name>
         <description>Privilege setting for TMR2.</description>
         <value>0x0400</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>TMR3</name>
         <description>Privilege setting for TMR3.</description>
         <value>0x0800</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>TMR4</name>
         <description>Privilege setting for TMR4.</description>
         <value>0x01000</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>TMR5</name>
         <description>Privilege setting for TMR5.</description>
         <value>0x02000</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>I3C</name>
         <description>Privilege setting for I3C.</description>
         <value>0x04000</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>UART</name>
         <description>Privilege setting for UART.</description>
         <value>0x08000</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>SPI</name>
         <description>Privilege setting for SPI.</description>
         <value>0x010000</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>TRNG</name>
         <description>Privilege setting for TRNG.</description>
         <value>0x020000</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>BTLE_DBB</name>
         <description>Privilege setting for BTLE DBB.</description>
         <value>0x040000</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>BTLE_RFFE</name>
         <description>Privilege setting for BTLE RFFE.</description>
         <value>0x080000</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>RSTZ</name>
         <description>Privilege setting for RSTZ.</description>
         <value>0x0100000</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>BOOST</name>
         <description>Privilege setting for Boost Controller.</description>
         <value>0x0200000</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>TRIMSIR</name>
         <description>Privilege setting for TRIMSIR.</description>
         <value>0x0400000</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>RTC</name>
         <description>Privilege setting for RTC.</description>
         <value>0x01000000</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>WUT0</name>
         <description>Privilege setting for WUT0.</description>
         <value>0x02000000</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>WUT1</name>
         <description>Privilege setting for WUT1.</description>
         <value>0x04000000</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>PWRSEQ</name>
         <description>Privilege setting for Power Sequencer.</description>
         <value>0x08000000</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>MCR</name>
         <description>Privilege setting for MCR.</description>
         <value>0x10000000</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>ALL</name>
         <description>Privilege setting for all peripherals.</description>
         <value>0x1F7FFFFF</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
     </fields>
    </register>
    <register>
     <name>AHBMPRIV</name>
     <description>AHB Privileged/Non-privileged Secure DMA Access.</description>
     <addressOffset>0x0170</addressOffset>
     <fields>
      <field>
       <name>DMA</name>
       <description>Controls access of transactions coming from the Secure DMA.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>GPIO0</name>
     <description>Secure GPIO0 Configuration Register.</description>
     <addressOffset>0x0180</addressOffset>
     <fields>
      <field>
       <name>PINS</name>
       <description>Each bit configures a GPIO pin as secure or non-secure on GPIO Port 0. Secure GPIO pins prevent software from reading GPIO Data In pin states.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>14</bitWidth>
      </field>
     </fields>
    </register>
